界面1:
{
		文字框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"文字框1",
		显示内容:"注意事项：",
		文字大小:0,
		高度:0,
		宽度:0
	},	
	文字框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"文字框1",
		显示内容:"1：一定要在出征封地场景（或者城池界面）启动辅助！",
		文字大小:0,
		高度:0,
		宽度:0
	},	
	文字框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"文字框1",
		显示内容:"2：如果筛选始终不对，请加群联系群主。",
		文字大小:0,
		高度:0,
		宽度:0
	},	
		文字框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"文字框1",
		显示内容:"3：手机、电脑(下载安卓模拟器)均可使用",
		文字大小:0,
		高度:0,
		宽度:0
	},	
		文字框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"文字框1",
		显示内容:"------------------------",
		文字大小:20,
		高度:0,
		宽度:0
	},
	
	文字框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"文字框1",
		显示内容:"★选择好要使用的功能后，请到对应区域进行设置后启动即可★",
		文字大小:16,
		高度:0,
		宽度:0
	},

水平布局:
	{
	文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"●辅助功能选择：",
			文字大小:0,
			高度:0,
			宽度:0
		},	
	下拉框:
	{
		注释:"初始选项是可选属性，默认值为0。模版中设置了三个选项，您可以根据需要增加或减少，注意各选项之间用逗号分隔。",
		名称:"辅助功能",
		选项:
		[
		"自动刷黄",
		"整理宝箱",
		"自动建封",
		"自动找矿",
		"自动掠资",
		"自动副本",
		"自动找帅",	
		"自动喊话",
		"自动劝降",	
		"自动送将",
		"自助截图",
		"查询开区",
		"删除记录",
		],
		初始选项:0
	},	

},
		水平布局:
	{
	文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"●选择游戏版本：",
			文字大小:0,
			高度:0,
			宽度:0
		},	
	下拉框:
	{
		注释:"初始选项是可选属性，默认值为0。模版中设置了三个选项，您可以根据需要增加或减少，注意各选项之间用逗号分隔。",
		名称:"游戏版本",
		选项:
		[
		"九游",
		"腾讯",
		"百度",
		"热血帝王",
		"三国联盟",
		"新三国争霸",
		"繁体",
		"越南汉化版",
		],
		初始选项:0
	},	
},
水平布局:
{
	文字框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"文字框1",
		显示内容:"输入要查询开区时间的区服：",
		文字大小:0,
		高度:0,
		宽度:0
	},	
	输入框:
	{
		注释:"初始文本、文字大小、最大输入长度、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"查询区服",
		提示内容:"输入查询区服",
		初始文本:"30",
		仅输入数字:true,
		文字大小:0,
		最大输入长度:3,
		高度:0,
		宽度:200
	},	
	注释:"用于将多个控件放在同一行",
},	

文字框:
{
	注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
	名称:"文字框1",
	显示内容:"--注：查询区服开区时间请在上面选择查询开区功能。",
	文字大小:0,
	高度:0,
	宽度:0
},	
文字框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"文字框1",
		显示内容:"------------------------",
		文字大小:20,
		高度:0,
		宽度:0
	},
	
	文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"--注：游戏版本和出征封地必须选正确。",
			文字大小:0,
			高度:0,
			宽度:0
		},	

      水平布局:
	{
	
	多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"掉线重进",
			提示内容:"是否游戏卡死或掉线后重进",
			选中:false,
			文字大小:0,
			高度:0,
			宽度:0
		},

	},	
	水平布局:
	{
		文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框2",
			显示内容:"●出征封地在第几封地",
			文字大小:0,
			高度:0,
			宽度:0
		},	
		
		
		下拉框:
		{
			注释:"初始选项是可选属性，默认值为0。模版中设置了三个选项，您可以根据需要增加或减少，注意各选项之间用逗号分隔。",
			名称:"出征封地",
			选项:
			[
			"第 1 ",
			"第 2",
			"第 3",
			"第 4",
			"第 5",
			"倒 5",
			"倒 4 ",
			"倒 3",
			"倒 2",
			"倒 1",
			],
			初始选项:0
		},	
		注释:"用于将多个控件放在同一行",
	},	
	
	
	
	
	水平布局:
	{
	文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"腾讯帝王三国登录设置：",
			文字大小:0,
			高度:0,
			宽度:0
		},	
	下拉框:
	{
		注释:"初始选项是可选属性，默认值为0。模版中设置了三个选项，您可以根据需要增加或减少，注意各选项之间用逗号分隔。",
		名称:"腾讯登录方式",
		选项:
		[
		"QQ登录",
		"微信登录",
		],
		初始选项:0
	},	

},	

		文字框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"文字框1",
		显示内容:"------------------------",
		文字大小:20,
		高度:0,
		宽度:0
	},
	文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:" ★设置目录★",
			文字大小:0,
			高度:0,
			宽度:0
		},
	文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"●错误调整区域",
			文字大小:0,
			高度:0,
			宽度:0
		},
	文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"①自动刷黄设置",
			文字大小:0,
			高度:0,
			宽度:0
		},

	文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"②整理宝库设置",
			文字大小:0,
			高度:0,
			宽度:0
		},	
	
		文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"③自动找帅设置",
			文字大小:0,
			高度:0,
			宽度:0
		},	


				
		文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"④自动找矿设置",
			文字大小:0,
			高度:0,
			宽度:0
		},	

				文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"⑤自动掠夺设置",
			文字大小:0,
			高度:0,
			宽度:0
		},
		
	文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"⑥自动副本设置",
			文字大小:0,
			高度:0,
			宽度:0
		},	
	文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"⑦自动建封设置",
			文字大小:0,
			高度:0,
			宽度:0
		},	
		文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"⑧自动喊话设置",
			文字大小:0,
			高度:0,
			宽度:0
		},
		
		文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"⑨自动送将设置",
			文字大小:0,
			高度:0,
			宽度:0
		},
文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"⑩自助截图筛选",
			文字大小:0,
			高度:0,
			宽度:0
		},


	文字框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"文字框1",
		显示内容:"------------------------",
		文字大小:20,
		高度:0,
		宽度:0
	},
	多选框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"是否是用红手指挂机",
		提示内容:"是否是在用云手机挂机",
		选中:false,
		文字大小:0,
		高度:0,
		宽度:0
	},	
	
	多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"使用教程",
			提示内容:"打开使用教程",
			选中:false,
			文字大小:0,
			高度:0,
			宽度:0
		},
			多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"强制执行",
			提示内容:"跳过使用介绍和检查适配",
			选中:false,
			文字大小:0,
			高度:0,
			宽度:0
		},	
文字框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"文字框1",
		显示内容:"------------------------",
		文字大小:20,
		高度:0,
		宽度:0
	},
	水平布局:
	{
		注释:"用于将多个控件放在同一行",
		多选框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"调低手机亮度",
		提示内容:"调低手机亮度",
		选中:false,
		文字大小:0,
		高度:0,
		宽度:0
	},	
		多选框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"是否锁屏",
		提示内容:"运行结束后锁屏",
		选中:true,
		文字大小:0,
		高度:0,
		宽度:0
	},	
		
	},	
	
		
		多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"禁止任何响铃和振动提醒",
			提示内容:"禁止任何响铃和振动提醒",
			选中:false,
			文字大小:0,
			高度:0,
			宽度:0
		},	
		
			

			文字框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"文字框1",
		显示内容:"------------------------",
		文字大小:20,
		高度:0,
		宽度:0
	},
	水平布局:
	{
	
		多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"是否警报提示",
			提示内容:"出现警报则报警：",
			选中:false,
			文字大小:0,
			高度:0,
			宽度:0
		},	
		下拉框:
		{
			注释:"初始选项是可选属性，默认值为0。模版中设置了三个选项，您可以根据需要增加或减少，注意各选项之间用逗号分隔。",
			名称:"警报提示类型",
			选项:
			[
			"刷黄期间",
			"单独监督",
			],
			初始选项:0
		},	
		注释:"用于将多个控件放在同一行",
		
	},	

	
	文字框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"文字框1",
		显示内容:"=============================",
		文字大小:0,
		高度:0,
		宽度:0
	},	

	
	
文字框:
	{
		
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"文字框1",
		显示内容:"1：QQ安卓交流群：478084505",
		文字大小:0,
		高度:0,
		宽度:0
	},	
	文字框:
	{
		
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"文字框1",
		显示内容:"      QQ苹果交流群：549366375",
		文字大小:0,
		高度:0,
		宽度:0
	},	
	文字框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"文字框1",
		显示内容:"2：目前支持分辨率：",
		文字大小:0,
		高度:0,
		宽度:0
	},	
			文字框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"文字框1",
		显示内容:"      480-854       480-800",
		文字大小:0,
		高度:0,
		宽度:0
	},	
		文字框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"文字框1",
		显示内容:"      720-1280     540-960",
		文字大小:0,
		高度:0,
		宽度:0
	},	
	文字框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"文字框1",
		显示内容:"    1080-1920   1440-2560",
		文字大小:0,
		高度:0,
		宽度:0
	},	
		文字框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"文字框1",
		显示内容:"3：手机字体要求是安卓默认字体。",
		文字大小:0,
		高度:0,
		宽度:0
	},	

	文字框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"文字框1",
		显示内容:"===================",
		文字大小:20,
		高度:0,
		宽度:0
	},
	文字框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"文字框1",
		显示内容:"●●●总体错误调整区域●●●",
		文字大小:0,
		高度:0,
		宽度:0
	},	
	

	文字框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"文字框1",
		显示内容:"===================",
		文字大小:20,
		高度:0,
		宽度:0
	},


水平布局:
	{
		文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"●等待网络反应时间（毫秒）：",
			文字大小:0,
			高度:0,
			宽度:0
		},	
		输入框:
		{
			注释:"初始文本、文字大小、最大输入长度、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"速度设置",
			提示内容:"毫秒",
			初始文本:"30",
			仅输入数字:false,
			文字大小:0,
			最大输入长度:0,
			高度:0,
			宽度:120
		},	
	},
	文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"--注：等待网络反应时间，可以控制运行速度，最快时可以设置为0。",
			文字大小:0,
			高度:0,
			宽度:0
		},	
			水平布局:
		{
			
			注释:"用于将多个控件放在同一行",
				文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"●宝物匹配度：",
			文字大小:0,
			高度:0,
			宽度:0
		},	
		输入框:
		{
			注释:"初始文本、文字大小、最大输入长度、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"宝物相似度",
			提示内容:"可以是小数后面2位",
			初始文本:"0.73",
			仅输入数字:false,
			文字大小:0,
			最大输入长度:0,
			高度:0,
			宽度:200
		},	
			
		},	
		文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"--注：如果把宝箱识别为宝物加0.01，不认识宝物则减0.01。",
			文字大小:0,
			高度:0,
			宽度:0
		},	
		
	水平布局:
		{
			
			注释:"用于将多个控件放在同一行",
				文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"●兵种匹配度：",
			文字大小:0,
			高度:0,
			宽度:0
		},	
		输入框:
		{
			注释:"初始文本、文字大小、最大输入长度、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"刷黄相似度",
			提示内容:"可以是小数后面2位",
			初始文本:"0.73",
			仅输入数字:false,
			文字大小:0,
			最大输入长度:0,
			高度:0,
			宽度:200
		},	

			
		},	
文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"--注：如果把弩兵识别为骑兵加0.01，不认识骑兵则减0.01。（海马玩模拟器可以设置为0.75）",
			文字大小:0,
			高度:0,
			宽度:0
		},	
		
		
		
				
		水平布局:
		{
			文字框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"文字框1",
				显示内容:"●俘虏成长匹配度：",
				文字大小:0,
				高度:0,
				宽度:0
			},	
			输入框:
			{
				注释:"初始文本、文字大小、最大输入长度、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"释放俘虏匹配度",
				提示内容:"0.5到1.0之间",
				初始文本:"0.73",
				仅输入数字:false,
				文字大小:0,
				最大输入长度:0,
				高度:0,
				宽度:200
			},	
			
	
		},	
		文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"--注：主要是用于电脑模拟器，以及部分手机。识别俘虏成长值错误可以调该匹配度，每次可以调加减 0.01。",
			文字大小:0,
			高度:0,
			宽度:0
		},	
		
		水平布局:
		{
			
			注释:"用于将多个控件放在同一行",
				文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"●刷矿匹配度调节：",
			文字大小:0,
			高度:0,
			宽度:0
		},	
		输入框:
		{
			注释:"初始文本、文字大小、最大输入长度、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"刷矿相似度",
			提示内容:"可以是小数后面2位",
			初始文本:"0.73",
			仅输入数字:false,
			文字大小:0,
			最大输入长度:0,
			高度:0,
			宽度:200
		},	

		},	
		文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"--注：若见无人矿不打，每次减小0.01；若见有人矿也打，每次加大0.01。",
			文字大小:0,
			高度:0,
			宽度:0
		},	
	
		文字框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"文字框1",
		显示内容:"--------------------------------------",
		文字大小:0,
		高度:0,
		宽度:0
	},	
	多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"是否正常输入",
			提示内容:"是否不能正常输入配兵数（或坐标数值）",
			选中:false,
			文字大小:0,
			高度:0,
			宽度:0
		},	
				文字框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"文字框1",
				显示内容:"----------------------------",
				文字大小:0,
				高度:0,
				宽度:0
			},	
			
			
		水平布局:
		{
			文字框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"文字框1",
				显示内容:"●十级黄巾贼能完整看几个兵种：",
				文字大小:0,
				高度:0,
				宽度:0
			},	
			下拉框:
			{
				注释:"初始选项是可选属性，默认值为0。模版中设置了三个选项，您可以根据需要增加或减少，注意各选项之间用逗号分隔。",
				名称:"一页将领数",
				选项:
				[
				"4个",
				"5个",
				],
				初始选项:1
			},	
			注释:"用于将多个控件放在同一行",
			
			
		},	
		

		文字框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"文字框1",
				显示内容:"--说明：这个设置和配兵也息息相关。一般十级黄巾贼能完整看到5个兵种，但在使用字体大师或字体管家里的安卓默认字体后可能只有4个，需要对应设置。",
				文字大小:0,
				高度:0,
				宽度:0
			},	
	
				文字框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"文字框1",
		显示内容:"-------------------------------------------------",
		文字大小:0,
		高度:0,
		宽度:0
	},	
		文字框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"文字框1",
		显示内容:"------------翻页次数设置-----------------",
		文字大小:0,
		高度:0,
		宽度:0
	},	
		水平布局:
	{
		注释:"用于将多个控件放在同一行",
	文字框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"文字框1",
		显示内容:"●上下翻的最大次数：",
		文字大小:0,
		高度:0,
		宽度:0
	},	

	输入框:
	{
		注释:"初始文本、文字大小、最大输入长度、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"上下翻的最大次数",
		提示内容:"8",
		初始文本:"8",
		仅输入数字:true,
		文字大小:0,
		最大输入长度:2,
		高度:0,
		宽度:100
	},	
		},	
		
		
			水平布局:
	{
		注释:"用于将多个控件放在同一行",
	文字框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"文字框1",
		显示内容:"●左右 翻的最大次数：",
		文字大小:0,
		高度:0,
		宽度:0,
	},	
	
	
	
		
	输入框:
	{
		注释:"初始文本、文字大小、最大输入长度、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"左右翻的最大次数",
		提示内容:"32",
		初始文本:"32",
		仅输入数字:true,
		文字大小:0,
		最大输入长度:2,
		高度:0,
		宽度:100
	},	
	
		},	
		文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"--注：挑战服和普通服不一样。上下翻页次数，挑战服可以设置为12。",
			文字大小:0,
			高度:0,
			宽度:0
		},	
			
		
文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅",
			文字大小:0,
			高度:0,
			宽度:0
		},	
	
		
		
		
	文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"====①自动刷黄设置====",
			文字大小:0,
			高度:0,
			宽度:0
		},	
		
文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅",
			文字大小:0,
			高度:0,
			宽度:0
		},
	文字框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"文字框1",
		显示内容:"使用说明：",
		文字大小:0,
		高度:0,
		宽度:0
	},	
	文字框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"文字框1",
		显示内容:"1：若选择自动配兵和加体，只能等将全部返回再出发；",
		文字大小:0,
		高度:0,
		宽度:0
	},	
		文字框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"文字框1",
		显示内容:"2：在角落里的出征封地最好设置一下翻页方向；",
		文字大小:0,
		高度:0,
		宽度:0
	},
	文字框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"文字框1",
		显示内容:"--------------------------------------",
		文字大小:0,
		高度:0,
		宽度:0
	},	
	文字框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"文字框1",
		显示内容:"★注意500次刷黄是游戏上限，超过后无任何奖励★",
		文字大小:0,
		高度:0,
		宽度:0
	},	
		水平布局:
		{
			文字框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"文字框1",
				显示内容:"设置刷黄次数",
				文字大小:0,
				高度:0,
				宽度:0
			},	
			输入框:
			{
				注释:"初始文本、文字大小、最大输入长度、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"刷黄次数设置",
				提示内容:"数字",
				初始文本:"500",
				仅输入数字:true,
				文字大小:0,
				最大输入长度:0,
				高度:0,
				宽度:0
			},	
			
			注释:"用于将多个控件放在同一行",
			
		},	
			水平布局:
		{
			文字框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"文字框1",
				显示内容:"出征后几分钟开始下一轮",
				文字大小:0,
				高度:0,
				宽度:0
			},	
			输入框:
			{
				注释:"初始文本、文字大小、最大输入长度、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"刷黄间隔时间",
				提示内容:"单位分钟",
				初始文本:"5.5",
				仅输入数字:false,
				文字大小:0,
				最大输入长度:0,
				高度:0,
				宽度:0
			},	
			
			
			注释:"用于将多个控件放在同一行",
		},	
			
		水平布局:
		{
		
	多选框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"刷黄间隔期间清理宝库",
		提示内容:"刷黄每几轮清理一次宝库",
		选中:false,
		文字大小:0,
		高度:0,
		宽度:0
	},	
	输入框:
	{
		注释:"初始文本、文字大小、最大输入长度、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"清理宝库频率",
		提示内容:"每多少轮后清理宝库一次",
		初始文本:"5",
		仅输入数字:true,
		文字大小:0,
		最大输入长度:0,
		高度:0,
		宽度:100
	},	
	
			
		},	

	文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"【注意】银票等会自动开启",
			文字大小:0,
			高度:0,
			宽度:0
		},	
	
	
	文字框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"文字框1",
		显示内容:"--------------------------------------",
		文字大小:0,
		高度:0,
		宽度:0
	},	
	文字框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"文字框1",
		显示内容:"找黄设置：",
		文字大小:0,
		高度:0,
		宽度:0
	},	

文字框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"文字框1",
		显示内容:"--------------------------------------",
		文字大小:0,
		高度:0,
		宽度:0
	},	
	
		多选框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"刷黄是否从指定坐标开始",
		提示内容:"是否从指定坐标开始",
		选中:false,
		文字大小:0,
		高度:0,
		宽度:0
	},
水平布局:
	{
	文字框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"文字框1",
		显示内容:"开始坐标：",
		文字大小:0,
		高度:0,
		宽度:0
	},	
	文字框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"文字框1",
		显示内容:"X：",
		文字大小:0,
		高度:0,
		宽度:0
	},	
		输入框:
		{
			注释:"初始文本、文字大小、最大输入长度、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"刷黄X坐标点",
			
			提示内容:"X坐标",
			初始文本:"0",
			仅输入数字:true,
			文字大小:0,
			最大输入长度:0,
			高度:0,
			宽度:100
		},	
		注释:"用于将多个控件放在同一行",
文字框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"文字框1",
		显示内容:"Y：",
		文字大小:0,
		高度:0,
		宽度:0
	},	
		输入框:
		{
			注释:"初始文本、文字大小、最大输入长度、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"刷黄Y坐标点",
			
			提示内容:"Y坐标",
			初始文本:"0",
			仅输入数字:true,
			文字大小:0,
			最大输入长度:0,
			高度:0,
			宽度:100
		},	
	
	},	
	
	水平布局:
	{
		文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"一轮找黄最长时间（分钟）",
			文字大小:0,
			高度:0,
			宽度:0
		},	
		输入框:
		{
			注释:"初始文本、文字大小、最大输入长度、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"一轮找黄最长时间",
			提示内容:"单位（分钟）",
			初始文本:"15",
			仅输入数字:true,
			文字大小:0,
			最大输入长度:0,
			高度:0,
			宽度:200
		},	
		
		注释:"用于将多个控件放在同一行",
	},	
	
	
	
水平布局:
	{
		文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"整体往左翻页还是往右",
			文字大小:0,
			高度:0,
			宽度:0
		},	
		下拉框:
		{
			注释:"初始选项是可选属性，默认值为0。模版中设置了三个选项，您可以根据需要增加或减少，注意各选项之间用逗号分隔。",
			名称:"左右翻选择",
			选项:
			[
			"左",
			"右",
			],
			初始选项:1
		},	
		
		注释:"用于将多个控件放在同一行",
		
		
		
	},	
	
水平布局:
	{
		文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"先往上翻还是往下翻",
			文字大小:0,
			高度:0,
			宽度:0
		},	
		下拉框:
		{
			注释:"初始选项是可选属性，默认值为0。模版中设置了三个选项，您可以根据需要增加或减少，注意各选项之间用逗号分隔。",
			名称:"上下翻选择",
			选项:
			[
			"上",
			"下",
			],
			初始选项:1
		},	
		
		注释:"用于将多个控件放在同一行",
	
		
	},	

	多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"自动换向",
			提示内容:"是否一轮换一次方向找黄",
			选中:true,
			文字大小:0,
			高度:0,
			宽度:0
		},	
		
	文字框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"文字框1",
		显示内容:"--------------------------------------",
		文字大小:0,
		高度:0,
		宽度:0
	},	
	水平布局:
	{
		注释:"用于将多个控件放在同一行",
				
	多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"自动治疗",
			提示内容:"自动治疗",
			选中:true,
			文字大小:0,
			高度:0,
			宽度:0
		},	
	
		
				多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"自动加体",
			提示内容:"自动加体",
			选中:false,
			文字大小:0,
			高度:0,
			宽度:0
		},	
		
		
	},	
	
		多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"检查治疗伤兵",
			提示内容:"检查铜钱不足时停止刷黄",
			选中:true,
			文字大小:0,
			高度:0,
			宽度:0
		},	
		
		
		文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"加体力必须要有活血丹，要求安卓默认字体，vip2以上最好选择系统加体。",
			文字大小:0,
			高度:0,
			宽度:0
		},	
		
		文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"----------------------------------",
			文字大小:0,
			高度:0,
			宽度:0
		},	
		多选框:
{
	注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
	名称:"是否刷黄异常",
	提示内容:"是否不筛选也见黄不打",
	选中:false,
	文字大小:0,
	高度:0,
	宽度:0
},	

		文字框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"文字框1",
		显示内容:"------------------------",
		文字大小:20,
		高度:0,
		宽度:0
	},
		多选框:
{
	注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
	名称:"筛选前判断将领能否出征",
	提示内容:"是否筛选前判断将领能否出征",
	选中:false,
	文字大小:0,
	高度:0,
	宽度:0
},	
多选框:
{
	注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
	名称:"刷黄等级增加",
	提示内容:"是否编队也可以刷比设置等级低一级的黄巾贼",
	选中:false,
	文字大小:0,
	高度:0,
	宽度:0
},	

		文字框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"文字框1",
		显示内容:"------------------------",
		文字大小:20,
		高度:0,
		宽度:0
	},
	
				文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"【注意】筛选必须是安卓默认（经典）字体，否则无效，模拟器不用管，手机有设置字体的请直接设置（vivo手机请在 i 主题里切换到自带经典字体），oppo，小米等手机可以试着调设置里的刷黄匹配度，每次加减0.01。",
			文字大小:0,
			高度:0,
			宽度:0
		},	
		
				文字框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"文字框1",
		显示内容:"------------------------",
		文字大小:20,
		高度:0,
		宽度:0
	},
	
		文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"设置出征编队：",
			文字大小:0,
			高度:0,
			宽度:0
		},	
		
		
			
		
		水平布局:
		{
			多选框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"编队1",
				提示内容:"编队1",
				选中:true,
				文字大小:0,
				高度:0,
				宽度:0
			},	
			注释:"用于将多个控件放在同一行",
			
			下拉框:
		{
			注释:"初始选项是可选属性，默认值为0。模版中设置了三个选项，您可以根据需要增加或减少，注意各选项之间用逗号分隔。",
			名称:"编队1刷黄级数",
			选项:
			[
			"10级",
			" 9级",
			" 8级",
			" 7级",
			" 6级",
			" 5级",
			" 4级",
			" 3级",
			" 2级",
			" 1级",
			],
			初始选项:7
		},	
			
			文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"			",
			文字大小:0,
			高度:0,
			宽度:0
		},	
			
			
			多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"是否要求兵种1",
			提示内容:"筛选兵种",
			选中:false,
			文字大小:0,
			高度:0,
			宽度:0
		},	
		
			
		},	
		
				水平布局:
		{
			文字框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"文字框1",
				显示内容:"骑<=",
				文字大小:0,
				高度:0,
				宽度:0
			},	
			下拉框:
			{
				注释:"初始选项是可选属性，默认值为0。模版中设置了三个选项，您可以根据需要增加或减少，注意各选项之间用逗号分隔。",
				名称:"骑兵1",
				选项:
				[
				
				"5",
				"4",
				"3",
				"2",
				"1",
				"0",
				],
				初始选项:0
			},	
			文字框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"文字框1",
				显示内容:"弓<=",
				文字大小:0,
				高度:0,
				宽度:0
			},	
			下拉框:
			{
				注释:"初始选项是可选属性，默认值为0。模版中设置了三个选项，您可以根据需要增加或减少，注意各选项之间用逗号分隔。",
				名称:"弓兵1",
				选项:
				[
				
				"5",
				"4",
				"3",
				"2",
				"1",
				"0",
				],
				初始选项:0
			},	
			
			文字框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"文字框1",
				显示内容:"车<=",
				文字大小:0,
				高度:0,
				宽度:0
			},	
			下拉框:
			{
				注释:"初始选项是可选属性，默认值为0。模版中设置了三个选项，您可以根据需要增加或减少，注意各选项之间用逗号分隔。",
				名称:"车兵1",
				选项:
				[
				
				"5",
				"4",
				"3",
				"2",
				"1",
				"0",
				],
				初始选项:0
			},	
			文字框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"文字框1",
				显示内容:"步<=",
				文字大小:0,
				高度:0,
				宽度:0
			},	
			下拉框:
			{
				注释:"初始选项是可选属性，默认值为0。模版中设置了三个选项，您可以根据需要增加或减少，注意各选项之间用逗号分隔。",
				名称:"步兵1",
				选项:
				[
				
				"5",
				"4",
				"3",
				"2",
				"1",
				"0",
				],
				初始选项:0
			},	
			
			
			},	
			
			
			
			文字框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"文字框1",
				显示内容:"●勾选全盾或者无盾，是在上面的筛选后，可以额外打全盾或者无盾的情况。",
				文字大小:0,
				高度:0,
				宽度:0
			},	
			文字框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"文字框1",
				显示内容:"●盾指的是步或骑（如：无盾即没有步或骑，全盾即只有步或骑）。",
				文字大小:0,
				高度:0,
				宽度:0
			},	
			
				水平布局:
	{
		多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"全盾1",
			提示内容:"全盾",
			选中:false,
			文字大小:0,
			高度:0,
			宽度:0
		},	
		多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"无盾1",
			提示内容:"无盾",
			选中:false,
			文字大小:0,
			高度:0,
			宽度:0
		},	
		多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"一盾1",
			提示内容:"一盾",
			选中:false,
			文字大小:0,
			高度:0,
			宽度:0
		},	
		多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"二盾1",
			提示内容:"二盾",
			选中:false,
			文字大小:0,
			高度:0,
			宽度:0
		},	
		注释:"用于将多个控件放在同一行",
		
	},	
	
		
	水平布局:
		{
			注释:"用于将多个控件放在同一行",

			文字框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"文字框1",
				显示内容:"掉落物品：",
				文字大小:0,
				高度:0,
				宽度:0
			},	
		
		下拉框:
		{
			注释:"初始选项是可选属性，默认值为0。模版中设置了三个选项，您可以根据需要增加或减少，注意各选项之间用逗号分隔。",
			名称:"掉落物品1",
			选项:
			[
			"无要求",
			"含宝物",
			"含装备",
			"宝物或装备",
			"宝物且装备",
			"含宝箱",
			],
			初始选项:0
		},	
	},		
		
		水平布局:
		{
			注释:"用于将多个控件放在同一行",

			多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"兵力1",
			提示内容:"筛选兵力>=",
			选中:false,
			文字大小:0,
			高度:0,
			宽度:0
		},	
		
		下拉框:
		{
			注释:"初始选项是可选属性，默认值为0。模版中设置了三个选项，您可以根据需要增加或减少，注意各选项之间用逗号分隔。",
			名称:"黄巾兵力1",
			选项:
			[
			"0",
			"10000",
			"9000",
			"8000",
			"7000",
			"6000",
			"5000",
			"4000",
			"3000",
			],
			初始选项:0
		},	
	},	
	
		文字框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"文字框1",
				显示内容:"【注】兵种筛选手机可用，兵力筛选手机禁用，仅限电脑",
				文字大小:0,
				高度:0,
				宽度:0
			},	
	
			文字框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"文字框1",
				显示内容:"------------------------------",
				文字大小:0,
				高度:0,
				宽度:0
			},	
		
				水平布局:
		{
			多选框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"编队2",
				提示内容:"编队2",
				选中:false,
				文字大小:0,
				高度:0,
				宽度:0
			},	
			注释:"用于将多个控件放在同一行",
			
			下拉框:
		{
			注释:"初始选项是可选属性，默认值为0。模版中设置了三个选项，您可以根据需要增加或减少，注意各选项之间用逗号分隔。",
			名称:"编队2刷黄级数",
			选项:
			[
			"10级",
			" 9级",
			" 8级",
			" 7级",
			" 6级",
			" 5级",
			" 4级",
			" 3级",
			" 2级",
			" 1级",
			],
			初始选项:0
		},	
		
				文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"			",
			文字大小:0,
			高度:0,
			宽度:0
		},	
			多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"是否要求兵种2",
			提示内容:"筛选兵种",
			选中:false,
			文字大小:0,
			高度:0,
			宽度:0
		},	
			
		},	
		
				水平布局:
		{
			文字框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"文字框1",
				显示内容:"骑<=",
				文字大小:0,
				高度:0,
				宽度:0
			},	
			下拉框:
			{
				注释:"初始选项是可选属性，默认值为0。模版中设置了三个选项，您可以根据需要增加或减少，注意各选项之间用逗号分隔。",
				名称:"骑兵2",
				选项:
				[
				
				"5",
				"4",
				"3",
				"2",
				"1",
				"0",
				],
				初始选项:0
			},	
			文字框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"文字框1",
				显示内容:"弓<=",
				文字大小:0,
				高度:0,
				宽度:0
			},	
			下拉框:
			{
				注释:"初始选项是可选属性，默认值为0。模版中设置了三个选项，您可以根据需要增加或减少，注意各选项之间用逗号分隔。",
				名称:"弓兵2",
				选项:
				[
				
				"5",
				"4",
				"3",
				"2",
				"1",
				"0",
				],
				初始选项:0
			},	
			文字框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"文字框1",
				显示内容:"车<=",
				文字大小:0,
				高度:0,
				宽度:0
			},	
			下拉框:
			{
				注释:"初始选项是可选属性，默认值为0。模版中设置了三个选项，您可以根据需要增加或减少，注意各选项之间用逗号分隔。",
				名称:"车兵2",
				选项:
				[
				
				"5",
				"4",
				"3",
				"2",
				"1",
				"0",
				],
				初始选项:0
			},	
			文字框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"文字框1",
				显示内容:"步<=",
				文字大小:0,
				高度:0,
				宽度:0
			},	
			下拉框:
			{
				注释:"初始选项是可选属性，默认值为0。模版中设置了三个选项，您可以根据需要增加或减少，注意各选项之间用逗号分隔。",
				名称:"步兵2",
				选项:
				[
				
				"5",
				"4",
				"3",
				"2",
				"1",
				"0",
				],
				初始选项:0
			},	
			
			
			},	
			
			
				水平布局:
	{
		多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"全盾2",
			提示内容:"全盾",
			选中:false,
			文字大小:0,
			高度:0,
			宽度:0
		},	
		多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"无盾2",
			提示内容:"无盾",
			选中:false,
			文字大小:0,
			高度:0,
			宽度:0
		},	
		多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"一盾2",
			提示内容:"一盾",
			选中:false,
			文字大小:0,
			高度:0,
			宽度:0
		},	
		多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"二盾2",
			提示内容:"二盾",
			选中:false,
			文字大小:0,
			高度:0,
			宽度:0
		},	
		注释:"用于将多个控件放在同一行",
		
	},	
	
			
		水平布局:
		{
			注释:"用于将多个控件放在同一行",

			文字框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"文字框1",
				显示内容:"掉落物品：",
				文字大小:0,
				高度:0,
				宽度:0
			},	
		
		下拉框:
		{
			注释:"初始选项是可选属性，默认值为0。模版中设置了三个选项，您可以根据需要增加或减少，注意各选项之间用逗号分隔。",
			名称:"掉落物品2",
			选项:
			[
			"无要求",
			"含宝物",
			"含装备",
			"宝物或装备",
			"宝物且装备",
			"含宝箱",
			],
			初始选项:0
		},	
	},			
			
			
		水平布局:
		{
			注释:"用于将多个控件放在同一行",

			多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"兵力2",
			提示内容:"筛选兵力>=",
			选中:false,
			文字大小:0,
			高度:0,
			宽度:0
		},	
		
		下拉框:
		{
			注释:"初始选项是可选属性，默认值为0。模版中设置了三个选项，您可以根据需要增加或减少，注意各选项之间用逗号分隔。",
			名称:"黄巾兵力2",
			选项:
			[
			"0",
			"10000",
			"9000",
			"8000",
			"7000",
			"6000",
			"5000",
			"4000",
			"3000",
			],
			初始选项:0
		},	
	},	
	
			文字框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"文字框1",
				显示内容:"------------------------------",
				文字大小:0,
				高度:0,
				宽度:0
			},	
			水平布局:
		{
			多选框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"编队3",
				提示内容:"编队3",
				选中:false,
				文字大小:0,
				高度:0,
				宽度:0
			},	
			注释:"用于将多个控件放在同一行",
			
			下拉框:
		{
			注释:"初始选项是可选属性，默认值为0。模版中设置了三个选项，您可以根据需要增加或减少，注意各选项之间用逗号分隔。",
			名称:"编队3刷黄级数",
			选项:
			[
			"10级",
			" 9级",
			" 8级",
			" 7级",
			" 6级",
			" 5级",
			" 4级",
			" 3级",
			" 2级",
			" 1级",
			],
			初始选项:0
		},	
		
				文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"			",
			文字大小:0,
			高度:0,
			宽度:0
		},	
			多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"是否要求兵种3",
			提示内容:"筛选兵种",
			选中:false,
			文字大小:0,
			高度:0,
			宽度:0
		},	
			
		},	
		
				水平布局:
		{
			文字框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"文字框1",
				显示内容:"骑<=",
				文字大小:0,
				高度:0,
				宽度:0
			},	
			下拉框:
			{
				注释:"初始选项是可选属性，默认值为0。模版中设置了三个选项，您可以根据需要增加或减少，注意各选项之间用逗号分隔。",
				名称:"骑兵3",
				选项:
				[
				
				"5",
				"4",
				"3",
				"2",
				"1",
				"0",
				],
				初始选项:0
			},	
			文字框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"文字框1",
				显示内容:"弓<=",
				文字大小:0,
				高度:0,
				宽度:0
			},	
			下拉框:
			{
				注释:"初始选项是可选属性，默认值为0。模版中设置了三个选项，您可以根据需要增加或减少，注意各选项之间用逗号分隔。",
				名称:"弓兵3",
				选项:
				[
				
				"5",
				"4",
				"3",
				"2",
				"1",
				"0",
				],
				初始选项:0
			},	
					文字框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"文字框1",
				显示内容:"车<=",
				文字大小:0,
				高度:0,
				宽度:0
			},	
			下拉框:
			{
				注释:"初始选项是可选属性，默认值为0。模版中设置了三个选项，您可以根据需要增加或减少，注意各选项之间用逗号分隔。",
				名称:"车兵3",
				选项:
				[
				
				"5",
				"4",
				"3",
				"2",
				"1",
				"0",
				],
				初始选项:0
			},	
			文字框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"文字框1",
				显示内容:"步<=",
				文字大小:0,
				高度:0,
				宽度:0
			},	
			下拉框:
			{
				注释:"初始选项是可选属性，默认值为0。模版中设置了三个选项，您可以根据需要增加或减少，注意各选项之间用逗号分隔。",
				名称:"步兵3",
				选项:
				[
				
				"5",
				"4",
				"3",
				"2",
				"1",
				"0",
				],
				初始选项:0
			},	
	
			
			},	
		
		
		
			水平布局:
	{
		多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"全盾3",
			提示内容:"全盾",
			选中:false,
			文字大小:0,
			高度:0,
			宽度:0
		},	
		多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"无盾3",
			提示内容:"无盾",
			选中:false,
			文字大小:0,
			高度:0,
			宽度:0
		},	
		多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"一盾3",
			提示内容:"一盾",
			选中:false,
			文字大小:0,
			高度:0,
			宽度:0
		},	
		多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"二盾3",
			提示内容:"二盾",
			选中:false,
			文字大小:0,
			高度:0,
			宽度:0
		},	
		注释:"用于将多个控件放在同一行",
		
	},	
	
	
	
		水平布局:
		{
			注释:"用于将多个控件放在同一行",

			文字框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"文字框1",
				显示内容:"掉落物品：",
				文字大小:0,
				高度:0,
				宽度:0
			},	
		
		下拉框:
		{
			注释:"初始选项是可选属性，默认值为0。模版中设置了三个选项，您可以根据需要增加或减少，注意各选项之间用逗号分隔。",
			名称:"掉落物品3",
			选项:
			[
			"无要求",
			"含宝物",
			"含装备",
			"宝物或装备",
			"宝物且装备",
			"含宝箱",
			],
			初始选项:0
		},	
	},		
		水平布局:
		{
			注释:"用于将多个控件放在同一行",

			多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"兵力3",
			提示内容:"筛选兵力>=",
			选中:false,
			文字大小:0,
			高度:0,
			宽度:0
		},	
		
		下拉框:
		{
			注释:"初始选项是可选属性，默认值为0。模版中设置了三个选项，您可以根据需要增加或减少，注意各选项之间用逗号分隔。",
			名称:"黄巾兵力3",
			选项:
			[
			"0",
			"10000",
			"9000",
			"8000",
			"7000",
			"6000",
			"5000",
			"4000",
			"3000",
			],
			初始选项:0
		},	
	},	
	
	
			文字框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"文字框1",
				显示内容:"------------------------------",
				文字大小:0,
				高度:0,
				宽度:0
			},	
		
			水平布局:
		{
			多选框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"编队4",
				提示内容:"编队4",
				选中:false,
				文字大小:0,
				高度:0,
				宽度:0
			},	
			注释:"用于将多个控件放在同一行",
			
			下拉框:
		{
			注释:"初始选项是可选属性，默认值为0。模版中设置了三个选项，您可以根据需要增加或减少，注意各选项之间用逗号分隔。",
			名称:"编队4刷黄级数",
			选项:
			[
			"10级",
			" 9级",
			" 8级",
			" 7级",
			" 6级",
			" 5级",
			" 4级",
			" 3级",
			" 2级",
			" 1级",
			],
			初始选项:0
		},	
		
				文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"			",
			文字大小:0,
			高度:0,
			宽度:0
		},	
			多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"是否要求兵种4",
			提示内容:"筛选兵种",
			选中:false,
			文字大小:0,
			高度:0,
			宽度:0
		},	
			
		},	
		
				水平布局:
		{
			文字框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"文字框1",
				显示内容:"骑<=",
				文字大小:0,
				高度:0,
				宽度:0
			},	
			下拉框:
			{
				注释:"初始选项是可选属性，默认值为0。模版中设置了三个选项，您可以根据需要增加或减少，注意各选项之间用逗号分隔。",
				名称:"骑兵4",
				选项:
				[
				
				"5",
				"4",
				"3",
				"2",
				"1",
				"0",
				],
				初始选项:0
			},	
			文字框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"文字框1",
				显示内容:"弓<=",
				文字大小:0,
				高度:0,
				宽度:0
			},	
			下拉框:
			{
				注释:"初始选项是可选属性，默认值为0。模版中设置了三个选项，您可以根据需要增加或减少，注意各选项之间用逗号分隔。",
				名称:"弓兵4",
				选项:
				[
				
				"5",
				"4",
				"3",
				"2",
				"1",
				"0",
				],
				初始选项:0
			},	
			文字框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"文字框1",
				显示内容:"车<=",
				文字大小:0,
				高度:0,
				宽度:0
			},	
			下拉框:
			{
				注释:"初始选项是可选属性，默认值为0。模版中设置了三个选项，您可以根据需要增加或减少，注意各选项之间用逗号分隔。",
				名称:"车兵4",
				选项:
				[
				
				"5",
				"4",
				"3",
				"2",
				"1",
				"0",
				],
				初始选项:0
			},	
			文字框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"文字框1",
				显示内容:"步<=",
				文字大小:0,
				高度:0,
				宽度:0
			},	
			下拉框:
			{
				注释:"初始选项是可选属性，默认值为0。模版中设置了三个选项，您可以根据需要增加或减少，注意各选项之间用逗号分隔。",
				名称:"步兵4",
				选项:
				[
				
				"5",
				"4",
				"3",
				"2",
				"1",
				"0",
				],
				初始选项:0
			},	
			
			
			},	
			
			
			
				水平布局:
	{
		多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"全盾4",
			提示内容:"全盾",
			选中:false,
			文字大小:0,
			高度:0,
			宽度:0
		},	
		多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"无盾4",
			提示内容:"无盾",
			选中:false,
			文字大小:0,
			高度:0,
			宽度:0
		},	
		多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"一盾4",
			提示内容:"一盾",
			选中:false,
			文字大小:0,
			高度:0,
			宽度:0
		},	
		多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"二盾4",
			提示内容:"二盾",
			选中:false,
			文字大小:0,
			高度:0,
			宽度:0
		},	
		注释:"用于将多个控件放在同一行",
		
	},	
	
			
			水平布局:
		{
			注释:"用于将多个控件放在同一行",

			文字框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"文字框1",
				显示内容:"掉落物品：",
				文字大小:0,
				高度:0,
				宽度:0
			},	
		
		下拉框:
		{
			注释:"初始选项是可选属性，默认值为0。模版中设置了三个选项，您可以根据需要增加或减少，注意各选项之间用逗号分隔。",
			名称:"掉落物品4",
			选项:
			[
			"无要求",
			"含宝物",
			"含装备",
			"宝物或装备",
			"宝物且装备",
			"含宝箱",
			],
			初始选项:0
		},	
	},		
			
		水平布局:
		{
			注释:"用于将多个控件放在同一行",

			多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"兵力4",
			提示内容:"筛选兵力>=",
			选中:false,
			文字大小:0,
			高度:0,
			宽度:0
		},	
		
		下拉框:
		{
			注释:"初始选项是可选属性，默认值为0。模版中设置了三个选项，您可以根据需要增加或减少，注意各选项之间用逗号分隔。",
			名称:"黄巾兵力4",
			选项:
			[
			"0",
			"10000",
			"9000",
			"8000",
			"7000",
			"6000",
			"5000",
			"4000",
			"3000",
			],
			初始选项:0
		},	
	},	

	
		文字框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"文字框1",
				显示内容:"------------------------------",
				文字大小:0,
				高度:0,
				宽度:0
			},	
			水平布局:
		{
			多选框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"编队5",
				提示内容:"编队5",
				选中:false,
				文字大小:0,
				高度:0,
				宽度:0
			},	
			注释:"用于将多个控件放在同一行",
			
			下拉框:
		{
			注释:"初始选项是可选属性，默认值为0。模版中设置了三个选项，您可以根据需要增加或减少，注意各选项之间用逗号分隔。",
			名称:"编队5刷黄级数",
			选项:
			[
			"10级",
			" 9级",
			" 8级",
			" 7级",
			" 6级",
			" 5级",
			" 4级",
			" 3级",
			" 2级",
			" 1级",
			],
			初始选项:0
		},	
				文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"			",
			文字大小:0,
			高度:0,
			宽度:0
		},	
			多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"是否要求兵种5",
			提示内容:"筛选兵种",
			选中:false,
			文字大小:0,
			高度:0,
			宽度:0
		},	
			
		},	
		
				水平布局:
		{
			文字框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"文字框1",
				显示内容:"骑<=",
				文字大小:0,
				高度:0,
				宽度:0
			},	
			下拉框:
			{
				注释:"初始选项是可选属性，默认值为0。模版中设置了三个选项，您可以根据需要增加或减少，注意各选项之间用逗号分隔。",
				名称:"骑兵5",
				选项:
				[
				
				"5",
				"4",
				"3",
				"2",
				"1",
				"0",
				],
				初始选项:0
			},	
			文字框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"文字框1",
				显示内容:"弓<=",
				文字大小:0,
				高度:0,
				宽度:0
			},	
			下拉框:
			{
				注释:"初始选项是可选属性，默认值为0。模版中设置了三个选项，您可以根据需要增加或减少，注意各选项之间用逗号分隔。",
				名称:"弓兵5",
				选项:
				[
				
				"5",
				"4",
				"3",
				"2",
				"1",
				"0",
				],
				初始选项:0
			},	
					文字框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"文字框1",
				显示内容:"车<=",
				文字大小:0,
				高度:0,
				宽度:0
			},	
			下拉框:
			{
				注释:"初始选项是可选属性，默认值为0。模版中设置了三个选项，您可以根据需要增加或减少，注意各选项之间用逗号分隔。",
				名称:"车兵5",
				选项:
				[
				
				"5",
				"4",
				"3",
				"2",
				"1",
				"0",
				],
				初始选项:0
			},	
			
			文字框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"文字框1",
				显示内容:"步<=",
				文字大小:0,
				高度:0,
				宽度:0
			},	
			下拉框:
			{
				注释:"初始选项是可选属性，默认值为0。模版中设置了三个选项，您可以根据需要增加或减少，注意各选项之间用逗号分隔。",
				名称:"步兵5",
				选项:
				[
				
				"5",
				"4",
				"3",
				"2",
				"1",
				"0",
				],
				初始选项:0
			},	
	
			},	
		
			水平布局:
	{
		多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"全盾5",
			提示内容:"全盾",
			选中:false,
			文字大小:0,
			高度:0,
			宽度:0
		},	
		多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"无盾5",
			提示内容:"无盾",
			选中:false,
			文字大小:0,
			高度:0,
			宽度:0
		},	
		
		多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"一盾5",
			提示内容:"一盾",
			选中:false,
			文字大小:0,
			高度:0,
			宽度:0
		},	
		多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"二盾5",
			提示内容:"二盾",
			选中:false,
			文字大小:0,
			高度:0,
			宽度:0
		},	
		注释:"用于将多个控件放在同一行",
		
	},	
	
		
		水平布局:
		{
			注释:"用于将多个控件放在同一行",

			文字框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"文字框1",
				显示内容:"掉落物品：",
				文字大小:0,
				高度:0,
				宽度:0
			},	
		
		下拉框:
		{
			注释:"初始选项是可选属性，默认值为0。模版中设置了三个选项，您可以根据需要增加或减少，注意各选项之间用逗号分隔。",
			名称:"掉落物品5",
			选项:
			[
			"无要求",
			"含宝物",
			"含装备",
			"宝物或装备",
			"宝物且装备",
			"含宝箱",
			],
			初始选项:0
		},	
	},		
		
		
		水平布局:
		{
			注释:"用于将多个控件放在同一行",

			多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"兵力5",
			提示内容:"筛选兵力>=",
			选中:false,
			文字大小:0,
			高度:0,
			宽度:0
		},	
		
		下拉框:
		{
			注释:"初始选项是可选属性，默认值为0。模版中设置了三个选项，您可以根据需要增加或减少，注意各选项之间用逗号分隔。",
			名称:"黄巾兵力5",
			选项:
			[
			"0",
			"10000",
			"9000",
			"8000",
			"7000",
			"6000",
			"5000",
			"4000",
			"3000",
			],
			初始选项:0
		},	
	},	

	
		
				文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"▼▼▼▼▼▼▼▼▼▼▼▼▼▼▼▼▼▼▼",
			文字大小:0,
			高度:0,
			宽度:0
		},	
		多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"开启十队刷黄",
			提示内容:"开启十队刷黄",
			选中:false,
			文字大小:0,
			高度:0,
			宽度:0
		},	

		
		文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"▲▲▲▲▲▲▲▲▲▲▲▲▲▲▲▲▲▲▲",
			文字大小:0,
			高度:0,
			宽度:0
		},	
		
		
		文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"★十队刷黄使用说明【必读】：",
			文字大小:0,
			高度:0,
			宽度:0
		},	
		文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"●不选择十队刷黄，将是游戏内默认的5个编队；",
			文字大小:0,
			高度:0,
			宽度:0
		},	
		文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"●开启十队刷黄后，编队规定如下：",
			文字大小:0,
			高度:0,
			宽度:0
		},
		文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"1：原游戏编队一二三四五的各自前两个位置依然是编队12345，而新增加的5队678910，依次是原游戏编队一二三四五的各自的第3和第4个位置。",
			文字大小:0,
			高度:0,
			宽度:0
		},	
		文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"2：前5队必须是两将一队，后5队可以是单将。",
			文字大小:0,
			高度:0,
			宽度:0
		},	
		
		
				文字框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"文字框1",
				显示内容:"------------------------------",
				文字大小:0,
				高度:0,
				宽度:0
			},	
			水平布局:
		{
			多选框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"编队6",
				提示内容:"编队6",
				选中:false,
				文字大小:0,
				高度:0,
				宽度:0
			},	
			注释:"用于将多个控件放在同一行",
			
			下拉框:
		{
			注释:"初始选项是可选属性，默认值为0。模版中设置了三个选项，您可以根据需要增加或减少，注意各选项之间用逗号分隔。",
			名称:"编队6刷黄级数",
			选项:
			[
			"10级",
			" 9级",
			" 8级",
			" 7级",
			" 6级",
			" 5级",
			" 4级",
			" 3级",
			" 2级",
			" 1级",
			],
			初始选项:0
		},	
				文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"			",
			文字大小:0,
			高度:0,
			宽度:0
		},	
			多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"是否要求兵种6",
			提示内容:"筛选兵种",
			选中:false,
			文字大小:0,
			高度:0,
			宽度:0
		},	
			
		},	
		
				水平布局:
		{
			文字框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"文字框1",
				显示内容:"骑<=",
				文字大小:0,
				高度:0,
				宽度:0
			},	
			下拉框:
			{
				注释:"初始选项是可选属性，默认值为0。模版中设置了三个选项，您可以根据需要增加或减少，注意各选项之间用逗号分隔。",
				名称:"骑兵6",
				选项:
				[
				
				"5",
				"4",
				"3",
				"2",
				"1",
				"0",
				],
				初始选项:0
			},	
			文字框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"文字框1",
				显示内容:"弓<=",
				文字大小:0,
				高度:0,
				宽度:0
			},	
			下拉框:
			{
				注释:"初始选项是可选属性，默认值为0。模版中设置了三个选项，您可以根据需要增加或减少，注意各选项之间用逗号分隔。",
				名称:"弓兵6",
				选项:
				[
				
				"5",
				"4",
				"3",
				"2",
				"1",
				"0",
				],
				初始选项:0
			},	
			文字框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"文字框1",
				显示内容:"车<=",
				文字大小:0,
				高度:0,
				宽度:0
			},	
			下拉框:
			{
				注释:"初始选项是可选属性，默认值为0。模版中设置了三个选项，您可以根据需要增加或减少，注意各选项之间用逗号分隔。",
				名称:"车兵6",
				选项:
				[
				
				"5",
				"4",
				"3",
				"2",
				"1",
				"0",
				],
				初始选项:0
			},	
			文字框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"文字框1",
				显示内容:"步<=",
				文字大小:0,
				高度:0,
				宽度:0
			},	
			下拉框:
			{
				注释:"初始选项是可选属性，默认值为0。模版中设置了三个选项，您可以根据需要增加或减少，注意各选项之间用逗号分隔。",
				名称:"步兵6",
				选项:
				[
				
				"5",
				"4",
				"3",
				"2",
				"1",
				"0",
				],
				初始选项:0
			},	
			
			
			},	
			
			
				水平布局:
	{
		多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"全盾6",
			提示内容:"全盾",
			选中:false,
			文字大小:0,
			高度:0,
			宽度:0
		},	
		多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"无盾6",
			提示内容:"无盾",
			选中:false,
			文字大小:0,
			高度:0,
			宽度:0
		},	
		多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"一盾6",
			提示内容:"一盾",
			选中:false,
			文字大小:0,
			高度:0,
			宽度:0
		},	
		多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"二盾6",
			提示内容:"二盾",
			选中:false,
			文字大小:0,
			高度:0,
			宽度:0
		},	
		注释:"用于将多个控件放在同一行",
		
	},	
	
		
		水平布局:
		{
			注释:"用于将多个控件放在同一行",

			文字框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"文字框1",
				显示内容:"掉落物品：",
				文字大小:0,
				高度:0,
				宽度:0
			},	
		
		下拉框:
		{
			注释:"初始选项是可选属性，默认值为0。模版中设置了三个选项，您可以根据需要增加或减少，注意各选项之间用逗号分隔。",
			名称:"掉落物品6",
			选项:
			[
			"无要求",
			"含宝物",
			"含装备",
			"宝物或装备",
			"宝物且装备",
			"含宝箱",
			],
			初始选项:0
		},	
	},		
		
		
		水平布局:
		{
			注释:"用于将多个控件放在同一行",

			多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"兵力6",
			提示内容:"筛选兵力>=",
			选中:false,
			文字大小:0,
			高度:0,
			宽度:0
		},	
		
		下拉框:
		{
			注释:"初始选项是可选属性，默认值为0。模版中设置了三个选项，您可以根据需要增加或减少，注意各选项之间用逗号分隔。",
			名称:"黄巾兵力6",
			选项:
			[
			"0",
			"10000",
			"9000",
			"8000",
			"7000",
			"6000",
			"5000",
			"4000",
			"3000",
			],
			初始选项:0
		},	
	},	
文字框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"文字框1",
				显示内容:"【注意】兵种筛选手机可用，兵力筛选手机禁用，仅限电脑",
				文字大小:0,
				高度:0,
				宽度:0
			},	
	

		文字框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"文字框1",
				显示内容:"------------------------------",
				文字大小:0,
				高度:0,
				宽度:0
			},	
			水平布局:
		{
			多选框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"编队7",
				提示内容:"编队7",
				选中:false,
				文字大小:0,
				高度:0,
				宽度:0
			},	
			注释:"用于将多个控件放在同一行",
			
			下拉框:
		{
			注释:"初始选项是可选属性，默认值为0。模版中设置了三个选项，您可以根据需要增加或减少，注意各选项之间用逗号分隔。",
			名称:"编队7刷黄级数",
			选项:
			[
			"10级",
			" 9级",
			" 8级",
			" 7级",
			" 6级",
			" 5级",
			" 4级",
			" 3级",
			" 2级",
			" 1级",
			],
			初始选项:0
		},	
		
				文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"			",
			文字大小:0,
			高度:0,
			宽度:0
		},	
			多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"是否要求兵种7",
			提示内容:"筛选兵种",
			选中:false,
			文字大小:0,
			高度:0,
			宽度:0
		},	
			
		},	
		
				水平布局:
		{
			文字框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"文字框1",
				显示内容:"骑<=",
				文字大小:0,
				高度:0,
				宽度:0
			},	
			下拉框:
			{
				注释:"初始选项是可选属性，默认值为0。模版中设置了三个选项，您可以根据需要增加或减少，注意各选项之间用逗号分隔。",
				名称:"骑兵7",
				选项:
				[
				
				"5",
				"4",
				"3",
				"2",
				"1",
				"0",
				],
				初始选项:0
			},	
			文字框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"文字框1",
				显示内容:"弓<=",
				文字大小:0,
				高度:0,
				宽度:0
			},	
			下拉框:
			{
				注释:"初始选项是可选属性，默认值为0。模版中设置了三个选项，您可以根据需要增加或减少，注意各选项之间用逗号分隔。",
				名称:"弓兵7",
				选项:
				[
				
				"5",
				"4",
				"3",
				"2",
				"1",
				"0",
				],
				初始选项:0
			},	
			
				文字框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"文字框1",
				显示内容:"车<=",
				文字大小:0,
				高度:0,
				宽度:0
			},	
			下拉框:
			{
				注释:"初始选项是可选属性，默认值为0。模版中设置了三个选项，您可以根据需要增加或减少，注意各选项之间用逗号分隔。",
				名称:"车兵7",
				选项:
				[
				
				"5",
				"4",
				"3",
				"2",
				"1",
				"0",
				],
				初始选项:0
			},	
			文字框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"文字框1",
				显示内容:"步<=",
				文字大小:0,
				高度:0,
				宽度:0
			},	
			下拉框:
			{
				注释:"初始选项是可选属性，默认值为0。模版中设置了三个选项，您可以根据需要增加或减少，注意各选项之间用逗号分隔。",
				名称:"步兵7",
				选项:
				[
				
				"5",
				"4",
				"3",
				"2",
				"1",
				"0",
				],
				初始选项:0
			},	
		
			
			},	
		
		
			水平布局:
	{
		多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"全盾7",
			提示内容:"全盾",
			选中:false,
			文字大小:0,
			高度:0,
			宽度:0
		},	
		多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"无盾7",
			提示内容:"无盾",
			选中:false,
			文字大小:0,
			高度:0,
			宽度:0
		},	
		多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"一盾7",
			提示内容:"一盾",
			选中:false,
			文字大小:0,
			高度:0,
			宽度:0
		},	
		多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"二盾7",
			提示内容:"二盾",
			选中:false,
			文字大小:0,
			高度:0,
			宽度:0
		},	
		注释:"用于将多个控件放在同一行",
		
	},	
	
		水平布局:
		{
			注释:"用于将多个控件放在同一行",

			文字框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"文字框1",
				显示内容:"掉落物品：",
				文字大小:0,
				高度:0,
				宽度:0
			},	
		
		下拉框:
		{
			注释:"初始选项是可选属性，默认值为0。模版中设置了三个选项，您可以根据需要增加或减少，注意各选项之间用逗号分隔。",
			名称:"掉落物品7",
			选项:
			[
			"无要求",
			"含宝物",
			"含装备",
			"宝物或装备",
			"宝物且装备",
			"含宝箱",
			],
			初始选项:0
		},	
	},		
		
		
		水平布局:
		{
			注释:"用于将多个控件放在同一行",

			多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"兵力7",
			提示内容:"筛选兵力>=",
			选中:false,
			文字大小:0,
			高度:0,
			宽度:0
		},	
		
		下拉框:
		{
			注释:"初始选项是可选属性，默认值为0。模版中设置了三个选项，您可以根据需要增加或减少，注意各选项之间用逗号分隔。",
			名称:"黄巾兵力7",
			选项:
			[
			"0",
			"10000",
			"9000",
			"8000",
			"7000",
			"6000",
			"5000",
			"4000",
			"3000",
			],
			初始选项:0
		},	
	},	

				文字框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"文字框1",
				显示内容:"------------------------------",
				文字大小:0,
				高度:0,
				宽度:0
			},	
			水平布局:
		{
			多选框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"编队8",
				提示内容:"编队8",
				选中:false,
				文字大小:0,
				高度:0,
				宽度:0
			},	
			注释:"用于将多个控件放在同一行",
			
			下拉框:
		{
			注释:"初始选项是可选属性，默认值为0。模版中设置了三个选项，您可以根据需要增加或减少，注意各选项之间用逗号分隔。",
			名称:"编队8刷黄级数",
			选项:
			[
			"10级",
			" 9级",
			" 8级",
			" 7级",
			" 6级",
			" 5级",
			" 4级",
			" 3级",
			" 2级",
			" 1级",
			],
			初始选项:0
		},	
		
		文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"			",
			文字大小:0,
			高度:0,
			宽度:0
		},	
			多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"是否要求兵种8",
			提示内容:"筛选兵种",
			选中:false,
			文字大小:0,
			高度:0,
			宽度:0
		},	
			
		},	
		
				水平布局:
		{
			文字框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"文字框1",
				显示内容:"骑<=",
				文字大小:0,
				高度:0,
				宽度:0
			},	
			下拉框:
			{
				注释:"初始选项是可选属性，默认值为0。模版中设置了三个选项，您可以根据需要增加或减少，注意各选项之间用逗号分隔。",
				名称:"骑兵8",
				选项:
				[
				
				"5",
				"4",
				"3",
				"2",
				"1",
				"0",
				],
				初始选项:0
			},	
			文字框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"文字框1",
				显示内容:"弓<=",
				文字大小:0,
				高度:0,
				宽度:0
			},	
			下拉框:
			{
				注释:"初始选项是可选属性，默认值为0。模版中设置了三个选项，您可以根据需要增加或减少，注意各选项之间用逗号分隔。",
				名称:"弓兵8",
				选项:
				[
				
				"5",
				"4",
				"3",
				"2",
				"1",
				"0",
				],
				初始选项:0
			},	
						文字框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"文字框1",
				显示内容:"车<=",
				文字大小:0,
				高度:0,
				宽度:0
			},	
			下拉框:
			{
				注释:"初始选项是可选属性，默认值为0。模版中设置了三个选项，您可以根据需要增加或减少，注意各选项之间用逗号分隔。",
				名称:"车兵8",
				选项:
				[
				
				"5",
				"4",
				"3",
				"2",
				"1",
				"0",
				],
				初始选项:0
			},	
			文字框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"文字框1",
				显示内容:"步<=",
				文字大小:0,
				高度:0,
				宽度:0
			},	
			下拉框:
			{
				注释:"初始选项是可选属性，默认值为0。模版中设置了三个选项，您可以根据需要增加或减少，注意各选项之间用逗号分隔。",
				名称:"步兵8",
				选项:
				[
				
				"5",
				"4",
				"3",
				"2",
				"1",
				"0",
				],
				初始选项:0
			},	

			
			},	
		
			水平布局:
	{
		多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"全盾8",
			提示内容:"全盾",
			选中:false,
			文字大小:0,
			高度:0,
			宽度:0
		},	
		多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"无盾8",
			提示内容:"无盾",
			选中:false,
			文字大小:0,
			高度:0,
			宽度:0
		},	
		多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"一盾8",
			提示内容:"一盾",
			选中:false,
			文字大小:0,
			高度:0,
			宽度:0
		},	
		多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"二盾8",
			提示内容:"二盾",
			选中:false,
			文字大小:0,
			高度:0,
			宽度:0
		},	
		注释:"用于将多个控件放在同一行",
		
	},	
	
		
		水平布局:
		{
			注释:"用于将多个控件放在同一行",

			文字框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"文字框1",
				显示内容:"掉落物品：",
				文字大小:0,
				高度:0,
				宽度:0
			},	
		
		下拉框:
		{
			注释:"初始选项是可选属性，默认值为0。模版中设置了三个选项，您可以根据需要增加或减少，注意各选项之间用逗号分隔。",
			名称:"掉落物品8",
			选项:
			[
			"无要求",
			"含宝物",
			"含装备",
			"宝物或装备",
			"宝物且装备",
			"含宝箱",
			],
			初始选项:0
		},	
	},		
		
		
		水平布局:
		{
			注释:"用于将多个控件放在同一行",

			多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"兵力8",
			提示内容:"筛选兵力>=",
			选中:false,
			文字大小:0,
			高度:0,
			宽度:0
		},	
		
		下拉框:
		{
			注释:"初始选项是可选属性，默认值为0。模版中设置了三个选项，您可以根据需要增加或减少，注意各选项之间用逗号分隔。",
			名称:"黄巾兵力8",
			选项:
			[
			"0",
			"10000",
			"9000",
			"8000",
			"7000",
			"6000",
			"5000",
			"4000",
			"3000",
			],
			初始选项:0
		},	
	},	

	
				文字框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"文字框1",
				显示内容:"------------------------------",
				文字大小:0,
				高度:0,
				宽度:0
			},	
			水平布局:
		{
			多选框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"编队9",
				提示内容:"编队9",
				选中:false,
				文字大小:0,
				高度:0,
				宽度:0
			},	
			注释:"用于将多个控件放在同一行",
			
			下拉框:
		{
			注释:"初始选项是可选属性，默认值为0。模版中设置了三个选项，您可以根据需要增加或减少，注意各选项之间用逗号分隔。",
			名称:"编队9刷黄级数",
			选项:
			[
			"10级",
			" 9级",
			" 8级",
			" 7级",
			" 6级",
			" 5级",
			" 4级",
			" 3级",
			" 2级",
			" 1级",
			],
			初始选项:0
		},	
		
			文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"			",
			文字大小:0,
			高度:0,
			宽度:0
		},	
		
			多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"是否要求兵种9",
			提示内容:"筛选兵种",
			选中:false,
			文字大小:0,
			高度:0,
			宽度:0
		},	
			
		},	
		
			水平布局:
		{
			文字框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"文字框1",
				显示内容:"骑<=",
				文字大小:0,
				高度:0,
				宽度:0
			},	
			下拉框:
			{
				注释:"初始选项是可选属性，默认值为0。模版中设置了三个选项，您可以根据需要增加或减少，注意各选项之间用逗号分隔。",
				名称:"骑兵9",
				选项:
				[
				
				"5",
				"4",
				"3",
				"2",
				"1",
				"0",
				],
				初始选项:0
			},	
			文字框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"文字框1",
				显示内容:"弓<=",
				文字大小:0,
				高度:0,
				宽度:0
			},	
			下拉框:
			{
				注释:"初始选项是可选属性，默认值为0。模版中设置了三个选项，您可以根据需要增加或减少，注意各选项之间用逗号分隔。",
				名称:"弓兵9",
				选项:
				[
				
				"5",
				"4",
				"3",
				"2",
				"1",
				"0",
				],
				初始选项:0
			},	
			文字框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"文字框1",
				显示内容:"车<=",
				文字大小:0,
				高度:0,
				宽度:0
			},	
			下拉框:
			{
				注释:"初始选项是可选属性，默认值为0。模版中设置了三个选项，您可以根据需要增加或减少，注意各选项之间用逗号分隔。",
				名称:"车兵9",
				选项:
				[
				
				"5",
				"4",
				"3",
				"2",
				"1",
				"0",
				],
				初始选项:0
			},	
			文字框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"文字框1",
				显示内容:"步<=",
				文字大小:0,
				高度:0,
				宽度:0
			},	
			下拉框:
			{
				注释:"初始选项是可选属性，默认值为0。模版中设置了三个选项，您可以根据需要增加或减少，注意各选项之间用逗号分隔。",
				名称:"步兵9",
				选项:
				[
				
				"5",
				"4",
				"3",
				"2",
				"1",
				"0",
				],
				初始选项:0
			},	
			
			
			},	
		
			水平布局:
	{
		多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"全盾9",
			提示内容:"全盾",
			选中:false,
			文字大小:0,
			高度:0,
			宽度:0
		},	
		多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"无盾9",
			提示内容:"无盾",
			选中:false,
			文字大小:0,
			高度:0,
			宽度:0
		},	
		多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"一盾9",
			提示内容:"一盾",
			选中:false,
			文字大小:0,
			高度:0,
			宽度:0
		},	
		多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"二盾9",
			提示内容:"二盾",
			选中:false,
			文字大小:0,
			高度:0,
			宽度:0
		},	
		注释:"用于将多个控件放在同一行",
		
	},	
	
		水平布局:
		{
			注释:"用于将多个控件放在同一行",

			文字框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"文字框1",
				显示内容:"掉落物品：",
				文字大小:0,
				高度:0,
				宽度:0
			},	
		
		下拉框:
		{
			注释:"初始选项是可选属性，默认值为0。模版中设置了三个选项，您可以根据需要增加或减少，注意各选项之间用逗号分隔。",
			名称:"掉落物品9",
			选项:
			[
			"无要求",
			"含宝物",
			"含装备",
			"宝物或装备",
			"宝物且装备",
			"含宝箱",
			],
			初始选项:0
		},	
	},		
		
		
		水平布局:
		{
			注释:"用于将多个控件放在同一行",

			多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"兵力9",
			提示内容:"筛选兵力>=",
			选中:false,
			文字大小:0,
			高度:0,
			宽度:0
		},	
		
		下拉框:
		{
			注释:"初始选项是可选属性，默认值为0。模版中设置了三个选项，您可以根据需要增加或减少，注意各选项之间用逗号分隔。",
			名称:"黄巾兵力9",
			选项:
			[
			"0",
			"10000",
			"9000",
			"8000",
			"7000",
			"6000",
			"5000",
			"4000",
			"3000",
			],
			初始选项:0
		},	
	},	

				文字框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"文字框1",
				显示内容:"------------------------------",
				文字大小:0,
				高度:0,
				宽度:0
			},	
			水平布局:
		{
			多选框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"编队10",
				提示内容:"编队10",
				选中:false,
				文字大小:0,
				高度:0,
				宽度:0
			},	
			注释:"用于将多个控件放在同一行",
			
			下拉框:
		{
			注释:"初始选项是可选属性，默认值为0。模版中设置了三个选项，您可以根据需要增加或减少，注意各选项之间用逗号分隔。",
			名称:"编队10刷黄级数",
			选项:
			[
			"10级",
			" 9级",
			" 8级",
			" 7级",
			" 6级",
			" 5级",
			" 4级",
			" 3级",
			" 2级",
			" 1级",
			],
			初始选项:0
		},	
		
				文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"			",
			文字大小:0,
			高度:0,
			宽度:0
		},	
			多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"是否要求兵种10",
			提示内容:"筛选兵种",
			选中:false,
			文字大小:0,
			高度:0,
			宽度:0
		},	
			
		},	
		
				水平布局:
		{
			文字框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"文字框1",
				显示内容:"骑<=",
				文字大小:0,
				高度:0,
				宽度:0
			},	
			下拉框:
			{
				注释:"初始选项是可选属性，默认值为0。模版中设置了三个选项，您可以根据需要增加或减少，注意各选项之间用逗号分隔。",
				名称:"骑兵10",
				选项:
				[
				
				"5",
				"4",
				"3",
				"2",
				"1",
				"0",
				],
				初始选项:0
			},	
			文字框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"文字框1",
				显示内容:"弓<=",
				文字大小:0,
				高度:0,
				宽度:0
			},	
			下拉框:
			{
				注释:"初始选项是可选属性，默认值为0。模版中设置了三个选项，您可以根据需要增加或减少，注意各选项之间用逗号分隔。",
				名称:"弓兵10",
				选项:
				[
				
				"5",
				"4",
				"3",
				"2",
				"1",
				"0",
				],
				初始选项:0
			},	
			
				文字框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"文字框1",
				显示内容:"车<=",
				文字大小:0,
				高度:0,
				宽度:0
			},	
			下拉框:
			{
				注释:"初始选项是可选属性，默认值为0。模版中设置了三个选项，您可以根据需要增加或减少，注意各选项之间用逗号分隔。",
				名称:"车兵10",
				选项:
				[
				
				"5",
				"4",
				"3",
				"2",
				"1",
				"0",
				],
				初始选项:0
			},	
			文字框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"文字框1",
				显示内容:"步<=",
				文字大小:0,
				高度:0,
				宽度:0
			},	
			下拉框:
			{
				注释:"初始选项是可选属性，默认值为0。模版中设置了三个选项，您可以根据需要增加或减少，注意各选项之间用逗号分隔。",
				名称:"步兵10",
				选项:
				[
				
				"5",
				"4",
				"3",
				"2",
				"1",
				"0",
				],
				初始选项:0
			},	
		
			
			},	
			
				水平布局:
	{
		多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"全盾10",
			提示内容:"全盾",
			选中:false,
			文字大小:0,
			高度:0,
			宽度:0
		},	
		多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"无盾10",
			提示内容:"无盾",
			选中:false,
			文字大小:0,
			高度:0,
			宽度:0
		},	
		多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"一盾10",
			提示内容:"一盾",
			选中:false,
			文字大小:0,
			高度:0,
			宽度:0
		},	
		多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"二盾10",
			提示内容:"二盾",
			选中:false,
			文字大小:0,
			高度:0,
			宽度:0
		},	
		注释:"用于将多个控件放在同一行",
		
	},	
	
		
		水平布局:
		{
			注释:"用于将多个控件放在同一行",

			文字框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"文字框1",
				显示内容:"掉落物品：",
				文字大小:0,
				高度:0,
				宽度:0
			},	
		
		下拉框:
		{
			注释:"初始选项是可选属性，默认值为0。模版中设置了三个选项，您可以根据需要增加或减少，注意各选项之间用逗号分隔。",
			名称:"掉落物品10",
			选项:
			[
			"无要求",
			"含宝物",
			"含装备",
			"宝物或装备",
			"宝物且装备",
			"含宝箱",
			],
			初始选项:0
		},	
	},		
		
		
		水平布局:
		{
			注释:"用于将多个控件放在同一行",

			多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"兵力10",
			提示内容:"筛选兵力>=",
			选中:false,
			文字大小:0,
			高度:0,
			宽度:0
		},	
		
		下拉框:
		{
			注释:"初始选项是可选属性，默认值为0。模版中设置了三个选项，您可以根据需要增加或减少，注意各选项之间用逗号分隔。",
			名称:"黄巾兵力10",
			选项:
			[
			"0",
			"10000",
			"9000",
			"8000",
			"7000",
			"6000",
			"5000",
			"4000",
			"3000",
			],
			初始选项:0
		},	
	},	
	

	
		
				文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"----------------------------",
			文字大小:0,
			高度:0,
			宽度:0
		},	
		

	
		文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"------------------------------",
			文字大小:0,
			高度:0,
			宽度:0
		},	
		
		文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"配兵设置：",
			文字大小:0,
			高度:0,
			宽度:0
		},	
			文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"------------------------------",
			文字大小:0,
			高度:0,
			宽度:0
		},	

			多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"满兵刷黄",
			提示内容:"是否满兵刷黄，跳过配兵",
			选中:true,
			文字大小:0,
			高度:0,
			宽度:0
		},	
		文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"★推荐补满刷黄，配兵耽误时间。★",
			文字大小:0,
			高度:0,
			宽度:0
		},	
		水平布局:
		{
			文字框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"文字框1",
				显示内容:"设置灰盾的带兵数：",
				文字大小:0,
				高度:0,
				宽度:0
			},	
			注释:"用于将多个控件放在同一行",
			
			输入框:
			{
				注释:"初始文本、文字大小、最大输入长度、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"肉盾带兵数",
				提示内容:"步灰，骑灰",
				初始文本:"2500",
				仅输入数字:true,
				文字大小:0,
				最大输入长度:4,
				高度:0,
				宽度:200
			},	
			
		},	
		
		水平布局:
		{
			文字框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"文字框1",
				显示内容:"设置输出的带兵数：",
				文字大小:0,
				高度:0,
				宽度:0
			},	
			注释:"用于将多个控件放在同一行",
			
			输入框:
			{
				注释:"初始文本、文字大小、最大输入长度、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"输出带兵数",
				提示内容:"弓，车等",
				初始文本:"2500",
				仅输入数字:true,
				文字大小:0,
				最大输入长度:4,
				高度:0,
				宽度:200
			},	
			
			
		},	
		
		

		水平布局:
		{
					文字框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"文字框1",
				显示内容:"设置几轮配兵（加体）一次：",
				文字大小:0,
				高度:0,
				宽度:0
			},	
			输入框:
			{
				注释:"初始文本、文字大小、最大输入长度、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"自动配兵频率",
				提示内容:"几轮配兵一次",
				初始文本:"1",
				仅输入数字:true,
				文字大小:0,
				最大输入长度:0,
				高度:0,
				宽度:100
			},	
		
			
	
		},	

		文字框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"文字框1",
				显示内容:"----------------------------",
				文字大小:0,
				高度:0,
				宽度:0
			},	
		文字框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"文字框1",
				显示内容:"★配兵说明：自动配兵请把前面补满刷黄的勾选去掉",
				文字大小:0,
				高度:0,
				宽度:0
			},	
			
			文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"★注：如果不能输入带兵数，请在前面错误调整区域设置。",
			文字大小:0,
			高度:0,
			宽度:0
		},	
				文字框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"文字框1",
				显示内容:"★自动配兵时建议：不刷黄的将不带兵",
				文字大小:0,
				高度:0,
				宽度:0
			},	

			文字框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"文字框1",
				显示内容:"----------------------------",
				文字大小:0,
				高度:0,
				宽度:0
			},	
			
		
		文字框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"文字框1",
				显示内容:"--------以下为刷黄间隔可以做的事-------",
				文字大小:0,
				高度:0,
				宽度:0
			},		
			
		
		
			文字框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"文字框1",
				显示内容:"----------------------------",
				文字大小:0,
				高度:0,
				宽度:0
			},	
			
				多选框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"刷黄结束后继续执行",
				提示内容:"是否刷黄结束后继续执行以下任务",
				选中:false,
				文字大小:0,
				高度:0,
				宽度:0
			},	
			文字框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"文字框1",
				显示内容:"注：相关功能请到相关区域设置后再使用。",
				文字大小:0,
				高度:0,
				宽度:0
			},	
			
			
			
				文字框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"文字框1",
				显示内容:"----------------------------",
				文字大小:0,
				高度:0,
				宽度:0
			},	
			
			
			水平布局:
		{
			多选框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"是否删除邮件",
				提示内容:"删除邮件几轮一次",
				选中:false,
				文字大小:0,
				高度:0,
				宽度:0
			},	
			输入框:
			{
				注释:"初始文本、文字大小、最大输入长度、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"删除邮件频率",
				提示内容:"几轮删除1次",
				初始文本:"1",
				仅输入数字:true,
				文字大小:0,
				最大输入长度:0,
				高度:0,
				宽度:100
			},	
			
	
		},	
		多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"开启刷黄期间自动送将",
			提示内容:"开启刷黄期间自动送将",
			选中:false,
			文字大小:0,
			高度:0,
			宽度:0
		},	
		
		
			
			水平布局:
		{
			多选框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"是否自动内政",
				提示内容:"自动建封几轮一次",
				选中:false,
				文字大小:0,
				高度:0,
				宽度:0
			},	
			输入框:
			{
				注释:"初始文本、文字大小、最大输入长度、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"自动内政频率",
				提示内容:"几轮建筑升级1次",
				初始文本:"10",
				仅输入数字:true,
				文字大小:0,
				最大输入长度:0,
				高度:0,
				宽度:100
			},	
			
		},	
			水平布局:
		{
			多选框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"是否转换资源到铜钱",
				提示内容:"转换资源到铜钱几轮一次",
				选中:false,
				文字大小:0,
				高度:0,
				宽度:0
			},	
			输入框:
			{
				注释:"初始文本、文字大小、最大输入长度、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"转换资源频率",
				提示内容:"几轮转换1次",
				初始文本:"10",
				仅输入数字:true,
				文字大小:0,
				最大输入长度:0,
				高度:0,
				宽度:100
			},	
			
	
		},	
		水平布局:
		{
			多选框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"是否喊话",
				提示内容:"自动喊话几轮一次",
				选中:false,
				文字大小:0,
				高度:0,
				宽度:0
			},	
			输入框:
			{
				注释:"初始文本、文字大小、最大输入长度、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"刷黄喊话频率",
				提示内容:"几轮喊话1次",
				初始文本:"3",
				仅输入数字:true,
				文字大小:0,
				最大输入长度:0,
				高度:0,
				宽度:100
			},	
			
	
		},	
				文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"----------------------------------",
			文字大小:0,
			高度:0,
			宽度:0
		},	
		
		水平布局:
		{
			多选框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"是否刷副本",
				提示内容:"刷副本几轮一次",
				选中:false,
				文字大小:0,
				高度:0,
				宽度:0
			},	
			
			输入框:
			{
				注释:"初始文本、文字大小、最大输入长度、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"刷副本频率",
				提示内容:"刷几轮黄后刷副本一次",
				初始文本:"5",
				仅输入数字:true,
				文字大小:0,
				最大输入长度:0,
				高度:0,
				宽度:100
			},	
			
		},	
		
		
						文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"----------------------------------",
			文字大小:0,
			高度:0,
			宽度:0
		},	
		
		水平布局:
		{
			多选框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"是否刷黄结束后开始刷副本",
				提示内容:"是否刷黄结束后单独刷副本",
				选中:false,
				文字大小:0,
				高度:0,
				宽度:0
			},	
			
		},	

		水平布局:
		{
			文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"刷黄后刷副本次数",
			文字大小:0,
			高度:0,
			宽度:0
		},	
			
			输入框:
			{
				注释:"初始文本、文字大小、最大输入长度、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"刷黄后刷副本次数",
				提示内容:"刷黄后刷副本次数",
				初始文本:"100",
				仅输入数字:true,
				文字大小:0,
				最大输入长度:0,
				高度:0,
				宽度:100
			},	
			
		},	

		
		文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"----------------------------------",
			文字大小:0,
			高度:0,
			宽度:0
		},	
			
		水平布局:
		{
			多选框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"是否闯关",
				提示内容:"闯关几轮一次",
				选中:false,
				文字大小:0,
				高度:0,
				宽度:0
			},	
			
			输入框:
			{
				注释:"初始文本、文字大小、最大输入长度、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"闯关频率",
				提示内容:"刷几轮黄后闯关一次",
				初始文本:"1",
				仅输入数字:true,
				文字大小:0,
				最大输入长度:0,
				高度:0,
				宽度:100
			},	
			
		},	
			水平布局:
		{
				文字框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"文字框1",
				显示内容:"闯关关卡",
				文字大小:0,
				高度:0,
				宽度:0
			},	

			下拉框:
			{
				注释:"初始选项是可选属性，默认值为0。模版中设置了三个选项，您可以根据需要增加或减少，注意各选项之间用逗号分隔。",
				名称:"闯关关卡",
				选项:
				[
				"10级",
				" 9级",
				" 8级",
				" 7级",
				" 6级",
				" 5级",
				" 4级",
				" 3级",
				" 2级",
				" 1级",
				],
				初始选项:9
			},	
			文字框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"文字框1",
				显示内容:"出征编队",
				文字大小:0,
				高度:0,
				宽度:0
			},	

			下拉框:
			{
				注释:"初始选项是可选属性，默认值为0。模版中设置了三个选项，您可以根据需要增加或减少，注意各选项之间用逗号分隔。",
				名称:"闯关出征编队",
				选项:
				[
				 "1",
				" 2",
				" 3",
				" 4",
				" 5",
				 "6",
				" 7",
				" 8",
				" 9",
				" 10",
				],
				初始选项:0
			},	
		},	
	
				水平布局:
		{
			文字框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"文字框1",
				显示内容:"闯关出征模式设置：",
				文字大小:0,
				高度:0,
				宽度:0
			},	
			下拉框:
			{
				注释:"初始选项是可选属性，默认值为0。模版中设置了三个选项，您可以根据需要增加或减少，注意各选项之间用逗号分隔。",
				名称:"闯关出征模式",
				选项:
				[
				"按五队模式出征",
				"按十队模式出征",
				],
				初始选项:0
			},	
			
			注释:"用于将多个控件放在同一行",
			
		},	
		文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"--------------------------",
			文字大小:0,
			高度:0,
			宽度:0
		},	
		
						水平布局:
		{
			多选框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"是否营救",
				提示内容:"自动营救几轮一次",
				选中:false,
				文字大小:0,
				高度:0,
				宽度:0
			},	
			输入框:
			{
				注释:"初始文本、文字大小、最大输入长度、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"刷黄营救频率",
				提示内容:"几轮刷黄后营救1次",
				初始文本:"10",
				仅输入数字:true,
				文字大小:0,
				最大输入长度:0,
				高度:0,
				宽度:100
			},	
			
	
		},	
	
			水平布局:
		{
			文字框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"文字框1",
				显示内容:"营救方式：",
				文字大小:0,
				高度:0,
				宽度:0
			},	
			下拉框:
			{
				注释:"初始选项是可选属性，默认值为0。模版中设置了三个选项，您可以根据需要增加或减少，注意各选项之间用逗号分隔。",
				名称:"营救方式",
				选项:
				[
				"使用铜钱",
				"使用黄金",
				],
				初始选项:0
			},	
		},	
		
		文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"----------------------------------",
			文字大小:0,
			高度:0,
			宽度:0
		},	
	文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"注：释放主要是用于电脑模拟器，以及部分手机。识别俘虏成长值错误可以在前面错误调整区域调成长匹配度。",
			文字大小:0,
			高度:0,
			宽度:0
		},	


		水平布局:
		{
			注释:"用于将多个控件放在同一行",
			文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"●释放成长值小于：",
			文字大小:0,
			高度:0,
			宽度:0
		},	
		下拉框:
		{
			注释:"初始选项是可选属性，默认值为0。模版中设置了三个选项，您可以根据需要增加或减少，注意各选项之间用逗号分隔。",
			名称:"释放俘虏成长",
			选项:
			[
			"60",
			"70",
			],
			初始选项:0
		},	
		
		},	
		
		水平布局:
		{
			
		多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"开启详细成长释放",
			提示内容:"开启详细成长值释放小于：",
			选中:false,
			文字大小:0,
			高度:0,
			宽度:0
		},	
		
		输入框:
		{
			注释:"初始文本、文字大小、最大输入长度、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"详细俘虏成长",
			提示内容:"释放的俘虏成长值",
			初始文本:"60",
			仅输入数字:true,
			文字大小:0,
			最大输入长度:2,
			高度:0,
			宽度:200
		},	
			注释:"用于将多个控件放在同一行",
		},	
		
	
		水平布局:
		{
			多选框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"是否释放",
				提示内容:"自动释放俘虏几轮一次",
				选中:false,
				文字大小:0,
				高度:0,
				宽度:0
			},	
			输入框:
			{
				注释:"初始文本、文字大小、最大输入长度、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"刷黄释放频率",
				提示内容:"几轮刷黄后释放1次",
				初始文本:"20",
				仅输入数字:true,
				文字大小:0,
				最大输入长度:0,
				高度:0,
				宽度:100
			},	
			
	
		},	

		
		
		文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"注：有名将或其余重要俘虏时慎用。",
			文字大小:0,
			高度:0,
			宽度:0
		},	
		
		文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"--------------------------",
			文字大小:0,
			高度:0,
			宽度:0
		},	
		
						水平布局:
		{
			多选框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"是否劝降",
				提示内容:"自动劝降几轮一次",
				选中:false,
				文字大小:0,
				高度:0,
				宽度:0
			},	
			输入框:
			{
				注释:"初始文本、文字大小、最大输入长度、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"刷黄劝降频率",
				提示内容:"几轮刷黄后劝降1次",
				初始文本:"10",
				仅输入数字:true,
				文字大小:0,
				最大输入长度:0,
				高度:0,
				宽度:100
			},	
			
	
		},	
	
			水平布局:
		{
			文字框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"文字框1",
				显示内容:"劝降方式：",
				文字大小:0,
				高度:0,
				宽度:0
			},	
			下拉框:
			{
				注释:"初始选项是可选属性，默认值为0。模版中设置了三个选项，您可以根据需要增加或减少，注意各选项之间用逗号分隔。",
				名称:"劝降方式",
				选项:
				[
				"使用铜钱",
				"使用黄金",
				],
				初始选项:0
			},	
		},	

		水平布局:
		{
			
		多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"开启详细成长劝降",
			提示内容:"开启详细成长值劝降大于：",
			选中:false,
			文字大小:0,
			高度:0,
			宽度:0
		},	
		
		输入框:
		{
			注释:"初始文本、文字大小、最大输入长度、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"详细劝降成长",
			提示内容:"劝降的俘虏成长值",
			初始文本:"60",
			仅输入数字:true,
			文字大小:0,
			最大输入长度:2,
			高度:0,
			宽度:200
		},	
			注释:"用于将多个控件放在同一行",
		},	
			
		文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"--------------------------",
			文字大小:0,
			高度:0,
			宽度:0
		},	
		
		
		
		多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"开启刷黄期间刷矿",
			提示内容:"是否在刷黄期间刷矿",
			选中:false,
			文字大小:0,
			高度:0,
			宽度:0
		},	
		
		
		
		
	文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"--------------------------",
			文字大小:0,
			高度:0,
			宽度:0
		},
		
	
文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅",
			文字大小:0,
			高度:0,
			宽度:0
		},	
		
		文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"====②整理宝库设置====",
			文字大小:0,
			高度:0,
			宽度:0
		},	
文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅",
			文字大小:0,
			高度:0,
			宽度:0
		},	
		

	水平布局:
	{
		注释:"用于将多个控件放在同一行",
		多选框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"isQianDao",
		提示内容:"每日签到",
		选中:false,
		文字大小:0,
		高度:0,
		宽度:0
	},	
	文字框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"文字框1",
		显示内容:"        ",
		文字大小:0,
		高度:0,
		宽度:0
	},	
	
	多选框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"三捐",
		提示内容:"每日三捐",
		选中:false,
		文字大小:0,
		高度:0,
		宽度:0
	},	
	},	

	水平布局:
	{
		注释:"用于将多个控件放在同一行",
		多选框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"每日加忠",
		提示内容:"每日加忠",
		选中:false,
		文字大小:0,
		高度:0,
		宽度:0
	},	
	文字框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"文字框1",
		显示内容:"        ",
		文字大小:0,
		高度:0,
		宽度:0
	},	
	
	多选框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"领取勇士令",
		提示内容:"每日领取勇士令",
		选中:false,
		文字大小:0,
		高度:0,
		宽度:0
	},	
	},	
	
	
	文字框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"文字框1",
		显示内容:"----------------------",
		文字大小:0,
		高度:0,
		宽度:0
	},	
	
	
	
	
	
		水平布局:
	{
		注释:"用于将多个控件放在同一行",
		多选框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"领取任务奖励",
		提示内容:"领取任务奖励",
		选中:false,
		文字大小:0,
		高度:0,
		宽度:0
	},	

	多选框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"领取成就奖励",
		提示内容:"领取成就奖励",
		选中:false,
		文字大小:0,
		高度:0,
		宽度:0
	},	
	},	
	
		多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"isChange",
			提示内容:"整理结束切换账号",
			选中:false,
			文字大小:0,
			高度:0,
			宽度:0
		},	


	水平布局:
	{
		文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"每次开箱的最长时间",
			文字大小:0,
			高度:0,
			宽度:0
		},	
	
		
		输入框:
		{
			注释:"初始文本、文字大小、最大输入长度、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"inputTime",
			提示内容:"",
			初始文本:"2",
			仅输入数字:true,
			文字大小:0,
			最大输入长度:0,
			高度:0,
			宽度:100
		},	
		文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:" 分钟",
			文字大小:0,
			高度:0,
			宽度:0
		},	
		
		
	},	
	
		
	
	文字框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"文字框1",
		显示内容:"=============================",
		文字大小:0,
		高度:0,
		宽度:0
	},	
	文字框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"文字框1",
		显示内容:"选择要丢掉的未强化装备",
		文字大小:0,
		高度:0,
		宽度:0
	},	
		文字框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"文字框1",
		显示内容:"（默认丢弃普通装）",
		文字大小:0,
		高度:0,
		宽度:0
	},				
			文字框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"文字框1",
		显示内容:"★为了防止误判，请把重要的高级装备给将装备上，就不会被丢弃★",
		文字大小:0,
		高度:0,
		宽度:0
	},	
	水平布局:
	{
		注释:"用于将多个控件放在同一行",
	多选框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"良好",
		提示内容:"良好",
		选中:false,
		文字大小:0,
		高度:0,
		宽度:0
	},	
	多选框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"优秀",
		提示内容:"优秀",
		选中:false,
		文字大小:0,
		高度:0,
		宽度:0
	},	
	多选框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"卓越",
		提示内容:"卓越",
		选中:false,
		文字大小:0,
		高度:0,
		宽度:0
	},	

	},	
		
	文字框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"文字框1",
		显示内容:"选择要丢掉的道具：",
		文字大小:0,
		高度:0,
		宽度:0
	},	
	
	
	水平布局:
		{
			注释:"用于将多个控件放在同一行",
			多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"hjtj",
			提示内容:"黄巾头巾",
			选中:true,
			文字大小:0,
			高度:0,
			宽度:0
		},	
			多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"青铜钥匙",
			提示内容:"青铜钥匙",
			选中:false,
			文字大小:0,
			高度:0,
			宽度:0
		},	

		},	
		
		水平布局:
		{
			注释:"用于将多个控件放在同一行",
			多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"精铁宝箱",
			提示内容:"精铁宝箱",
			选中:true,
			文字大小:0,
			高度:0,
			宽度:0
		},	
			多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"青铜宝箱",
			提示内容:"青铜宝箱",
			选中:true,
			文字大小:0,
			高度:0,
			宽度:0
		},	

		},	
		
	
	
	文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅",
			文字大小:0,
			高度:0,
			宽度:0
		},	
		文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"====③自动找帅设置=====",
			文字大小:0,
			高度:0,
			宽度:0
		},	
		
文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅",
			文字大小:0,
			高度:0,
			宽度:0
		},	
		文字框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"文字框1",
		显示内容:"1：主帅们出现时间，为每次整点时，世界频道会通知；",
		文字大小:0,
		高度:0,
		宽度:0
	},
		文字框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"文字框1",
		显示内容:"2：找到后有铃声提示和振动警报；",
		文字大小:0,
		高度:0,
		宽度:0
	},
		文字框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"文字框1",
		显示内容:"3：找帅翻页方向可以在刷黄翻页方向设置进行设置；",
		文字大小:0,
		高度:0,
		宽度:0
	},	

			文字框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"文字框1",
		显示内容:"----------------------------------",
		文字大小:0,
		高度:0,
		宽度:0
	},
		水平布局:
	{
	
	多选框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"主帅",
		提示内容:"主帅",
		选中:true,
		文字大小:0,
		高度:0,
		宽度:0
	},	
	多选框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"主将",
		提示内容:"主将",
		选中:true,
		文字大小:0,
		高度:0,
		宽度:0
	},	
多选框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"渠帅",
		提示内容:"渠帅",
		选中:true,
		文字大小:0,
		高度:0,
		宽度:0
	},
	
		},
		
		多选框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"找帅是否从指定坐标开始",
		提示内容:"是否从指定坐标开始",
		选中:false,
		文字大小:0,
		高度:0,
		宽度:0
	},
	
	水平布局:
	{
	文字框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"文字框1",
		显示内容:"    X：",
		文字大小:0,
		高度:0,
		宽度:0
	},	
		输入框:
		{
			注释:"初始文本、文字大小、最大输入长度、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"找帅X坐标点",
			
			提示内容:"X坐标",
			初始文本:"0",
			仅输入数字:true,
			文字大小:0,
			最大输入长度:0,
			高度:0,
			宽度:100
		},	
		注释:"用于将多个控件放在同一行",
文字框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"文字框1",
		显示内容:"Y：",
		文字大小:0,
		高度:0,
		宽度:0
	},	
		输入框:
		{
			注释:"初始文本、文字大小、最大输入长度、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"找帅Y坐标点",
			
			提示内容:"Y坐标",
			初始文本:"0",
			仅输入数字:true,
			文字大小:0,
			最大输入长度:0,
			高度:0,
			宽度:100
		},	
	
	},	


文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅",
			文字大小:0,
			高度:0,
			宽度:0
		},
		文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"====④自动找矿设置====",
			文字大小:0,
			高度:0,
			宽度:0
		},	
		
文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅",
			文字大小:0,
			高度:0,
			宽度:0
		},
		文字框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"文字框1",
		显示内容:"使用说明：鉴于方便找到后的继续寻找，请在寻找资源的界面启动",
		文字大小:0,
		高度:0,
		宽度:0
	},	
	
	文字框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"文字框1",
		显示内容:"金矿说明：一般一轮出现1-2个金矿，上一轮金矿消失之后才会出现新的",
		文字大小:0,
		高度:0,
		宽度:0
	},	
		
		文字框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"文字框1",
		显示内容:"--------------------------------",
		文字大小:0,
		高度:0,
		宽度:0
	},	
	
		
	
	多选框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"是否从指定坐标开始",
		提示内容:"是否从指定坐标开始",
		选中:false,
		文字大小:0,
		高度:0,
		宽度:0
	},
水平布局:
	{
	文字框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"文字框1",
		显示内容:"开始坐标：",
		文字大小:0,
		高度:0,
		宽度:0
	},	
	文字框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"文字框1",
		显示内容:"X：",
		文字大小:0,
		高度:0,
		宽度:0
	},	
		输入框:
		{
			注释:"初始文本、文字大小、最大输入长度、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"X坐标点",
			
			提示内容:"X坐标",
			初始文本:"0",
			仅输入数字:true,
			文字大小:0,
			最大输入长度:0,
			高度:0,
			宽度:100
		},	
		注释:"用于将多个控件放在同一行",
文字框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"文字框1",
		显示内容:"Y：",
		文字大小:0,
		高度:0,
		宽度:0
	},	
		输入框:
		{
			注释:"初始文本、文字大小、最大输入长度、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"Y坐标点",
			
			提示内容:"Y坐标",
			初始文本:"0",
			仅输入数字:true,
			文字大小:0,
			最大输入长度:0,
			高度:0,
			宽度:100
		},	
	
	},	
	
	
	
水平布局:
	{
		文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"整体往左翻页还是往右",
			文字大小:0,
			高度:0,
			宽度:0
		},	
		下拉框:
		{
			注释:"初始选项是可选属性，默认值为0。模版中设置了三个选项，您可以根据需要增加或减少，注意各选项之间用逗号分隔。",
			名称:"找矿左右翻选择",
			选项:
			[
			"左",
			"右",
			],
			初始选项:1
		},	
		
		注释:"用于将多个控件放在同一行",
		
		
		
	},	
	
水平布局:
	{
		文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"先往上翻还是往下翻",
			文字大小:0,
			高度:0,
			宽度:0
		},	
		下拉框:
		{
			注释:"初始选项是可选属性，默认值为0。模版中设置了三个选项，您可以根据需要增加或减少，注意各选项之间用逗号分隔。",
			名称:"找矿上下翻选择",
			选项:
			[
			"上",
			"下",
			],
			初始选项:1
		},	
		
		注释:"用于将多个控件放在同一行",
	
		
	},	

	多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"找矿自动换向",
			提示内容:"是否一轮换一次方向找矿",
			选中:false,
			文字大小:0,
			高度:0,
			宽度:0
		},	
		
		
		
			文字框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"文字框1",
		显示内容:"--------------------------------",
		文字大小:0,
		高度:0,
		宽度:0
	},	
	多选框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"是否是无人矿",
		提示内容:"是否是无人矿",
		选中:true,
		文字大小:0,
		高度:0,
		宽度:0
	},
	文字框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"文字框1",
		显示内容:"注：如果打到有人矿请调大刷矿匹配度，每次0.01，反之见无人矿不打调小匹配度。",
		文字大小:0,
		高度:0,
		宽度:0
	},	
	
	水平布局:
	{
		注释:"用于将多个控件放在同一行",
		多选框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"是否一直循环找矿",
		提示内容:"是否一直循环找矿",
		选中:true,
		文字大小:0,
		高度:0,
		宽度:0
	},
	},	
	多选框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"是否启动后先检查资源点数量再找矿",
		提示内容:"是否启动后先检查资源点数量再找矿",
		选中:false,
		文字大小:0,
		高度:0,
		宽度:0
	},	
	
		
		文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"●请选择要找的矿：",
			文字大小:0,
			高度:0,
			宽度:0
		},	
		水平布局:
		{
			注释:"用于将多个控件放在同一行",
			
		多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"金矿",
			提示内容:"金	矿  ",
			选中:true,
			文字大小:0,
			高度:0,
			宽度:0
		},	
		多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"银矿",
			提示内容:"银	矿  ",
			选中:true,
			文字大小:0,
			高度:0,
			宽度:0
		},	
	多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"冰玉矿",
			提示内容:"冰玉矿",
			选中:true,
			文字大小:0,
			高度:0,
			宽度:0
		},	


},
		水平布局:
		{
			注释:"用于将多个控件放在同一行",
				多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"仙芝园",
			提示内容:"仙芝园",
			选中:true,
			文字大小:0,
			高度:0,
			宽度:0
		},	
		
		多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"玄铁矿",
			提示内容:"玄铁矿",
			选中:true,
			文字大小:0,
			高度:0,
			宽度:0
		},	
	多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"玉露园",
			提示内容:"玉露园",
			选中:true,
			文字大小:0,
			高度:0,
			宽度:0
		},	


},

		水平布局:
		{
			注释:"用于将多个控件放在同一行",
			
				多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"水晶矿",
			提示内容:"水晶矿",
			选中:true,
			文字大小:0,
			高度:0,
			宽度:0
		},	
多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"灵草园",
			提示内容:"灵草园",
			选中:true,
			文字大小:0,
			高度:0,
			宽度:0
		},	

			多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"牧场",
			提示内容:"牧场",
			选中:false,
			文字大小:0,
			高度:0,
			宽度:0
		},	
	

},
文字框:
{
	注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
	名称:"文字框1",
	显示内容:"-----------------------------",
	文字大小:0,
	高度:0,
	宽度:0
},	
水平布局:
{
	多选框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"要求牧场等级",
		提示内容:"是否要求牧场等级：",
		选中:false,
		文字大小:0,
		高度:0,
		宽度:0
	},	
	下拉框:
	{
		注释:"初始选项是可选属性，默认值为0。模版中设置了三个选项，您可以根据需要增加或减少，注意各选项之间用逗号分隔。",
		名称:"牧场等级",
		选项:
		[
		"1级",
		"2级",
		"3级",
		],
		初始选项:0
	},	
	
	注释:"用于将多个控件放在同一行",
},	
文字框:
{
	注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
	名称:"文字框1",
	显示内容:"★注：筛选牧场等级只能适用于电脑模拟器。",
	文字大小:0,
	高度:0,
	宽度:0
},	




文字框:
{
	注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
	名称:"文字框1",
	显示内容:"----------建议自动打矿时处于免战状态，或者用垃圾将刷矿----------",
	文字大小:0,
	高度:0,
	宽度:0
},	

多选框:
{
	注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
	名称:"是否自动打矿",
	提示内容:"是否自动发兵打矿",
	选中:true,
	文字大小:0,
	高度:0,
	宽度:0
},	


多选框:
{
	注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
	名称:"满兵打矿",
	提示内容:"是否满兵打矿",
	选中:false,
	文字大小:0,
	高度:0,
	宽度:0
},	

水平布局:
{
	注释:"用于将多个控件放在同一行",
	文字框:
{
	注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
	名称:"文字框1",
	显示内容:"一次自动打矿的个数：",
	文字大小:0,
	高度:0,
	宽度:0
},	
	
	
	下拉框:
{
	注释:"初始选项是可选属性，默认值为0。模版中设置了三个选项，您可以根据需要增加或减少，注意各选项之间用逗号分隔。",
	名称:"设置一次自动打矿的个数",
	选项:
	[
	"1",
	"2",
	"3",
	"4",
	"5",
	],
	初始选项:0
},	
	},
	
	 
	 
	 
	 
	
		文字框:
{
	注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
	名称:"文字框1",
	显示内容:"-------------------------------",
	文字大小:0,
	高度:0,
	宽度:0
},	

多选框:
{
	注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
	名称:"打矿前检查将领可否出征",
	提示内容:"打矿前检查将领是否可以出征",
	选中:false,
	文字大小:0,
	高度:0,
	宽度:0
},	

水平布局:
{
	注释:"用于将多个控件放在同一行",
	文字框:
{
	注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
	名称:"文字框1",
	显示内容:"打矿出征设置：",
	文字大小:0,
	高度:0,
	宽度:0
},	


下拉框:
{
	注释:"初始选项是可选属性，默认值为0。模版中设置了三个选项，您可以根据需要增加或减少，注意各选项之间用逗号分隔。",
	名称:"打矿出征设置",
	选项:
	[
	"按五队模式选择编队出征",
	"五队模式某队依次单将出征",
	"按十队模式选择编队出征",
	],
	初始选项:0
},	
},	

文字框:
{
	注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
	名称:"文字框1",
	显示内容:"----如果上面设置为五队模式出征方式，请选择出征编队----",
	文字大小:0,
	高度:0,
	宽度:0
},	
水平布局:
{
	注释:"用于将多个控件放在同一行",
	多选框:
{
	注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
	名称:"打矿五队模式编队1",
	提示内容:"1",
	选中:false,
	文字大小:0,
	高度:0,
	宽度:0
},	


多选框:
{
	注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
	名称:"打矿五队模式编队2",
	提示内容:"2",
	选中:false,
	文字大小:0,
	高度:0,
	宽度:0
},	
多选框:
{
	注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
	名称:"打矿五队模式编队3",
	提示内容:"3",
	选中:false,
	文字大小:0,
	高度:0,
	宽度:0
},	
多选框:
{
	注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
	名称:"打矿五队模式编队4",
	提示内容:"4",
	选中:false,
	文字大小:0,
	高度:0,
	宽度:0
},	
多选框:
{
	注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
	名称:"打矿五队模式编队5",
	提示内容:"5",
	选中:false,
	文字大小:0,
	高度:0,
	宽度:0
},	
	
},	


文字框:
{
	注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
	名称:"文字框1",
	显示内容:"----如果上面设置为十队模式出征方式，请选择出征编队----",
	文字大小:0,
	高度:0,
	宽度:0
},	
水平布局:
{
	注释:"用于将多个控件放在同一行",
	多选框:
{
	注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
	名称:"打矿编队1",
	提示内容:"1",
	选中:false,
	文字大小:0,
	高度:0,
	宽度:0
},	


多选框:
{
	注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
	名称:"打矿编队2",
	提示内容:"2",
	选中:false,
	文字大小:0,
	高度:0,
	宽度:0
},	
多选框:
{
	注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
	名称:"打矿编队3",
	提示内容:"3",
	选中:false,
	文字大小:0,
	高度:0,
	宽度:0
},	
多选框:
{
	注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
	名称:"打矿编队4",
	提示内容:"4",
	选中:false,
	文字大小:0,
	高度:0,
	宽度:0
},	
多选框:
{
	注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
	名称:"打矿编队5",
	提示内容:"5",
	选中:false,
	文字大小:0,
	高度:0,
	宽度:0
},	
	
},	
水平布局:
{
	注释:"用于将多个控件放在同一行",



多选框:
{
	注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
	名称:"打矿编队6",
	提示内容:"6",
	选中:false,
	文字大小:0,
	高度:0,
	宽度:0
},	
多选框:
{
	注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
	名称:"打矿编队7",
	提示内容:"7",
	选中:false,
	文字大小:0,
	高度:0,
	宽度:0
},	
多选框:
{
	注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
	名称:"打矿编队8",
	提示内容:"8",
	选中:false,
	文字大小:0,
	高度:0,
	宽度:0
},	
多选框:
{
	注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
	名称:"打矿编队9",
	提示内容:"9",
	选中:false,
	文字大小:0,
	高度:0,
	宽度:0
},	

多选框:
{
	注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
	名称:"打矿编队10",
	提示内容:"10",
	选中:false,
	文字大小:0,
	高度:0,
	宽度:0
},	

},	

文字框:
{
	注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
	名称:"文字框1",
	显示内容:"注：十队模式请参看开启十队刷黄说明。",
	文字大小:0,
	高度:0,
	宽度:0
},	


文字框:
{
	注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
	名称:"文字框1",
	显示内容:"-------------------------------",
	文字大小:0,
	高度:0,
	宽度:0
},	
文字框:
{
	注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
	名称:"文字框1",
	显示内容:"-------------------------------",
	文字大小:0,
	高度:0,
	宽度:0
},	
水平布局:
{
	文字框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"文字框1",
		显示内容:"选择要使用的加速道具：",
		文字大小:0,
		高度:0,
		宽度:0
	},	
	下拉框:
	{
		注释:"初始选项是可选属性，默认值为0。模版中设置了三个选项，您可以根据需要增加或减少，注意各选项之间用逗号分隔。",
		名称:"行军加速道具",
		选项:
		[
		"初级行军符",
		"中级行军符",
		"高级行军符",
		"特级行军符",
		],
		初始选项:0
	},	
	
	注释:"用于将多个控件放在同一行",
},	



文字框:
{
	注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
	名称:"文字框1",
	显示内容:"●选择需要打矿加速的矿：",
	文字大小:0,
	高度:0,
	宽度:0
},	
		水平布局:
		{
			注释:"用于将多个控件放在同一行",
			
		多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"加速金矿",
			提示内容:"金	矿  ",
			选中:false,
			文字大小:0,
			高度:0,
			宽度:0
		},	
		多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"加速银矿",
			提示内容:"银	矿  ",
			选中:false,
			文字大小:0,
			高度:0,
			宽度:0
		},	
	多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"加速冰玉矿",
			提示内容:"冰玉矿",
			选中:false,
			文字大小:0,
			高度:0,
			宽度:0
		},	


},
		
		水平布局:
		{
			注释:"用于将多个控件放在同一行",
				多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"加速仙芝园",
			提示内容:"仙芝园",
			选中:false,
			文字大小:0,
			高度:0,
			宽度:0
		},	
		
		多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"加速玄铁矿",
			提示内容:"玄铁矿",
			选中:false,
			文字大小:0,
			高度:0,
			宽度:0
		},	
	多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"加速玉露园",
			提示内容:"玉露园",
			选中:false,
			文字大小:0,
			高度:0,
			宽度:0
		},	


},

		水平布局:
		{
			注释:"用于将多个控件放在同一行",
			
				多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"加速水晶矿",
			提示内容:"水晶矿",
			选中:false,
			文字大小:0,
			高度:0,
			宽度:0
		},	
多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"加速灵草园",
			提示内容:"灵草园",
			选中:false,
			文字大小:0,
			高度:0,
			宽度:0
		},	

			多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"加速牧场",
			提示内容:"牧场",
			选中:false,
			文字大小:0,
			高度:0,
			宽度:0
		},	
},


文字框:
{
	注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
	名称:"文字框1",
	显示内容:"★自动加速，要求必须有符可以用，否则会异常。★",
	文字大小:0,
	高度:0,
	宽度:0
},	



	多选框:
{
	注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
	名称:"是否撤回驻防",
	提示内容:"是否打完矿撤回驻防",
	选中:true,
	文字大小:0,
	高度:0,
	宽度:0
},	

多选框:
{
	注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
	名称:"资源消失继续打矿",
	提示内容:"资源消失是否继续打矿",
	选中:true,
	文字大小:0,
	高度:0,
	宽度:0
},


	
	文字框:
{
	注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
	名称:"文字框1",
	显示内容:"-------------------------------",
	文字大小:0,
	高度:0,
	宽度:0
},	
文字框:
{
	注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
	名称:"文字框1",
	显示内容:"-使用说明：自动打矿请在编队里面设置好出征将领-",
	文字大小:0,
	高度:0,
	宽度:0
},	



文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅",
			文字大小:0,
			高度:0,
			宽度:0
		},
		文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"====⑤自动掠夺设置====",
			文字大小:0,
			高度:0,
			宽度:0
		},	
		
文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅",
			文字大小:0,
			高度:0,
			宽度:0
		},
		文字框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"文字框1",
		显示内容:"使用说明：",
		文字大小:0,
		高度:0,
		宽度:0
	},	
	文字框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"文字框1",
		显示内容:"1：在使用自动掠夺功能时，请将掠夺的封底放在收藏的第一个位置",
		文字大小:0,
		高度:0,
		宽度:0
	},	
	
	
		文字框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"文字框1",
		显示内容:"2：另外和刷黄一样切换到出征封底，在世界界面启动",
		文字大小:0,
		高度:0,
		宽度:0
	},	
	水平布局:
	{
	

	文字框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"文字框1",
		显示内容:"几分钟后开始下一轮掠夺：",
		文字大小:0,
		高度:0,
		宽度:0
	},	
	输入框:
	{
		注释:"初始文本、文字大小、最大输入长度、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"掠夺时间间隔",
		提示内容:"掠夺每轮的时间间隔",
		初始文本:"15",
		仅输入数字:true,
		文字大小:0,
		最大输入长度:0,
		高度:0,
		宽度:200
	},	
},		
	
	水平布局:
	{
	

	文字框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"文字框1",
		显示内容:"设置掠夺轮数：",
		文字大小:0,
		高度:0,
		宽度:0
	},	
	输入框:
	{
		注释:"初始文本、文字大小、最大输入长度、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"掠夺轮数",
		提示内容:"20",
		初始文本:"20",
		仅输入数字:true,
		文字大小:0,
		最大输入长度:0,
		高度:0,
		宽度:100
	},	
},

文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅",
			文字大小:0,
			高度:0,
			宽度:0
		},	
		文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"====⑥自动副本设置====",
			文字大小:0,
			高度:0,
			宽度:0
		},	
		
文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅",
			文字大小:0,
			高度:0,
			宽度:0
		},	
			文字框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"文字框1",
		显示内容:"使用说明--1：将要出征的编队设置好；2：自动治疗伤兵请在刷黄设置的地方勾选；3：请准备好足够的体药；4：刷滑头请用一级将领在某个编队带10个轻骑，不要有多余闲余轻骑",
		文字大小:0,
		高度:0,
		宽度:0
	},	
		
		多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"满兵刷副本",
			提示内容:"是否满兵刷副本",
			选中:true,
			文字大小:0,
			高度:0,
			宽度:0
		},	
		水平布局:
		{
			文字框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"文字框1",
				显示内容:"副本出征模式设置：",
				文字大小:0,
				高度:0,
				宽度:0
			},	
			下拉框:
			{
				注释:"初始选项是可选属性，默认值为0。模版中设置了三个选项，您可以根据需要增加或减少，注意各选项之间用逗号分隔。",
				名称:"副本出征模式",
				选项:
				[
				"按五队模式出征",
				"按十队模式出征",
				],
				初始选项:0
			},	
			
			注释:"用于将多个控件放在同一行",
			
		},	
		
		水平布局:
		{
			注释:"用于将多个控件放在同一行",
			文字框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"文字框1",
				显示内容:"副本出征编队",
				文字大小:0,
				高度:0,
				宽度:0
			},	

			下拉框:
			{
				注释:"初始选项是可选属性，默认值为0。模版中设置了三个选项，您可以根据需要增加或减少，注意各选项之间用逗号分隔。",
				名称:"副本出征编队",
				选项:
				[
				 "1",
				" 2",
				" 3",
				" 4",
				" 5",
				 "6",
				" 7",
				" 8",
				" 9",
				" 10",
				],
				初始选项:0
			},	
		},	
		
		
		
		多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"副本是否各编队轮流出征",
			提示内容:"是否各个编队轮流出征",
			选中:false,
			文字大小:0,
			高度:0,
			宽度:0
		},	
		
	水平布局:
	{
	

	文字框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"文字框1",
		显示内容:"设置刷副本次数：",
		文字大小:0,
		高度:0,
		宽度:0
	},	
	输入框:
	{
		注释:"初始文本、文字大小、最大输入长度、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"副本总次数",
		提示内容:"20",
		初始文本:"600",
		仅输入数字:true,
		文字大小:0,
		最大输入长度:0,
		高度:0,
		宽度:100
	},	
},

水平布局:
	{
	

	文字框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"文字框1",
		显示内容:"等待将领返回限定时间（分钟）：",
		文字大小:0,
		高度:0,
		宽度:0
	},	
	输入框:
	{
		注释:"初始文本、文字大小、最大输入长度、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"副本将领返回限定时间",
		提示内容:"分钟",
		初始文本:"4",
		仅输入数字:true,
		文字大小:0,
		最大输入长度:0,
		高度:0,
		宽度:200
	},	
},


水平布局:
	{
	

	文字框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"文字框1",
		显示内容:"副本方式：",
		文字大小:0,
		高度:0,
		宽度:0
	},	
	
	下拉框:
{
	注释:"初始选项是可选属性，默认值为0。模版中设置了三个选项，您可以根据需要增加或减少，注意各选项之间用逗号分隔。",
	名称:"副本方式",
	选项:
	[
	"刷同一个副本",
	"刷下个新副本",
	"刷滑头称号",
	],
	初始选项:0
},	
},	


	水平布局:
	{
	

	文字框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"文字框1",
		显示内容:"副本章节：",
		文字大小:0,
		高度:0,
		宽度:0
	},	
	下拉框:
{
	注释:"初始选项是可选属性，默认值为0。模版中设置了三个选项，您可以根据需要增加或减少，注意各选项之间用逗号分隔。",
	名称:"副本章节",
	选项:
	[
	"第七章",
	"第六章",
	"第五章",
	"第四章",
	"第三章",
	"第二章",
	"第一章",
	
	],
	初始选项:6
},	

	文字框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"文字框1",
		显示内容:"关卡：",
		文字大小:0,
		高度:0,
		宽度:0
	},	
下拉框:
{
	注释:"初始选项是可选属性，默认值为0。模版中设置了三个选项，您可以根据需要增加或减少，注意各选项之间用逗号分隔。",
	名称:"副本关卡",
	选项:
	[
	"1",
	"2",
	"3",
	"4",
	"5",
	"6",
	"7",
	"8",
	"9",
	"10",
	"11",
	"12",
	"13",
	"boss"
	],
	初始选项:0
},	
},

水平布局:
{
	文字框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"文字框1",
		显示内容:"设置开启宝箱位置：",
		文字大小:0,
		高度:0,
		宽度:0
	},	
	下拉框:
	{
		注释:"初始选项是可选属性，默认值为0。模版中设置了三个选项，您可以根据需要增加或减少，注意各选项之间用逗号分隔。",
		名称:"宝箱位置",
		选项:
		[
		"随机开启",
		"第一个",
		"第二个",
		"第三个",
		],
		初始选项:0
	},	
	
	注释:"用于将多个控件放在同一行",
	
	
},	


文字框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"文字框1",
		显示内容:"---------------------------------",
		文字大小:0,
		高度:0,
		宽度:0
	},	
文字框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"文字框1",
		显示内容:"【关卡说明】每个章节boss出将神魂和卓越装备，第七章出56级黄金盔和黄金铠",
		文字大小:0,
		高度:0,
		宽度:0
	},	

	文字框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"文字框1",
		显示内容:"----------------------------------",
		文字大小:0,
		高度:0,
		宽度:0
	},	
	水平布局:
	{
		注释:"用于将多个控件放在同一行",
			多选框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"开启副本后刷黄",
		提示内容:"几分钟后开始自动刷黄：",
		选中:false,
		文字大小:0,
		高度:0,
		宽度:0
	},	
	输入框:
	{
		注释:"初始文本、文字大小、最大输入长度、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"副本后刷黄时间",
		提示内容:"可以通过这个不需要在每天晚上12点后再启动",
		初始文本:"80",
		仅输入数字:true,
		文字大小:0,
		最大输入长度:0,
		高度:0,
		宽度:200
	},	
	
	},	
	
	
	
文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅",
			文字大小:0,
			高度:0,
			宽度:0
		},
文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"====⑦自动建封设置====",
			文字大小:0,
			高度:0,
			宽度:0
		},	
文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅",
			文字大小:0,
			高度:0,
			宽度:0
		},
		
	水平布局:
	{
	
	文字框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"文字框1",
		显示内容:"请选择建封功能：",
		文字大小:0,
		高度:0,
		宽度:0
	},	
	下拉框:
	{
		注释:"初始选项是可选属性，默认值为0。模版中设置了三个选项，您可以根据需要增加或减少，注意各选项之间用逗号分隔。",
		名称:"建设方式",
		选项:
		[
		"建设一级封地",
		"自动升级建筑",
		],
		初始选项:1
	},	
		注释:"用于将多个控件放在同一行",
	},	
	文字框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"文字框1",
		显示内容:"======================== ",
		文字大小:0,
		高度:0,
		宽度:0
	},	

	水平布局:
	{
		注释:"用于将多个控件放在同一行",

	
	文字框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"文字框1",
		显示内容:"请选择要建设的类型：",
		文字大小:0,
		高度:0,
		宽度:0
	},	
	下拉框:
	{
		注释:"初始选项是可选属性，默认值为0。模版中设置了三个选项，您可以根据需要增加或减少，注意各选项之间用逗号分隔。",
		名称:"建设类型",
		选项:
		[
		"房屋",
		"农田",
		],
		初始选项:0
	},	
	},	
	文字框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"文字框1",
		显示内容:"--------------------------------------- ",
		文字大小:0,
		高度:0,
		宽度:0
	},	

水平布局:
	{
		注释:"用于将多个控件放在同一行",

	
	文字框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"文字框1",
		显示内容:"封地的总数是：",
		文字大小:0,
		高度:0,
		宽度:0
	},	
	下拉框:
	{
		注释:"初始选项是可选属性，默认值为0。模版中设置了三个选项，您可以根据需要增加或减少，注意各选项之间用逗号分隔。",
		名称:"封地总数",
		选项:
		[
		"10",
		"9",
		"8",
		"7",
		"6",
		"5",
		"4",
		"3",
		"2",
		"1",
		],
		初始选项:0
	},	
	},	
	

	文字框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"文字框1",
		显示内容:"选择需要升级的封地：",
		文字大小:0,
		高度:0,
		宽度:0
	},	
	水平布局:
	{
		多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"封地1",
			提示内容:"1封",
			选中:true,
			文字大小:0,
			高度:0,
			宽度:0
		},	
		多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"封地2",
			提示内容:"2封",
			选中:true,
			文字大小:0,
			高度:0,
			宽度:0
		},	
		多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"封地3",
			提示内容:"3封",
			选中:true,
			文字大小:0,
			高度:0,
			宽度:0
		},	
		多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"封地4",
			提示内容:"4封",
			选中:true,
			文字大小:0,
			高度:0,
			宽度:0
		},	
		多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"封地5",
			提示内容:"5封",
			选中:true,
			文字大小:0,
			高度:0,
			宽度:0
		},	
		
		注释:"用于将多个控件放在同一行",
	},	
	
	水平布局:
	{
		多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"封地6",
			提示内容:"6封",
			选中:true,
			文字大小:0,
			高度:0,
			宽度:0
		},	
		多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"封地7",
			提示内容:"7封",
			选中:true,
			文字大小:0,
			高度:0,
			宽度:0
		},	
		多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"封地8",
			提示内容:"8封",
			选中:true,
			文字大小:0,
			高度:0,
			宽度:0
		},	
		多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"封地9",
			提示内容:"9封",
			选中:true,
			文字大小:0,
			高度:0,
			宽度:0
		},	
		多选框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"封地10",
			提示内容:"10封",
			选中:true,
			文字大小:0,
			高度:0,
			宽度:0
		},	
		
		注释:"用于将多个控件放在同一行",
	},	
	
	多选框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"优先升级大厅",
		提示内容:"是否优先升级封地大厅",
		选中:false,
		文字大小:0,
		高度:0,
		宽度:0
	},	
	多选框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"是否建设完自动升级建筑",
		提示内容:"是否在建设完一级封地后开始自动升级建筑",
		选中:true,
		文字大小:0,
		高度:0,
		宽度:0
	},	

		多选框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"检查该封地是否建筑队已满",
		提示内容:"检查该封地是否建筑队已满",
		选中:true,
		文字大小:0,
		高度:0,
		宽度:0
	},	
	
文字框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"文字框1",
		显示内容:"建设一级封地说明：",
		文字大小:0,
		高度:0,
		宽度:0
	},	
	文字框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"文字框1",
		显示内容:"1：建设时请先关掉自动建封",
		文字大小:0,
		高度:0,
		宽度:0
	},	
	文字框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"文字框1",
		显示内容:"2：一级兵封和书院自己要先建好",
		文字大小:0,
		高度:0,
		宽度:0
	},	
	
	
	
	
	
文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅",
			文字大小:0,
			高度:0,
			宽度:0
		},	
		文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"====⑧自动喊话设置====",
			文字大小:0,
			高度:0,
			宽度:0
		},	
文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅",
			文字大小:0,
			高度:0,
			宽度:0
		},	
水平布局:
	{
		文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"设置喊话时间间隔（秒）：  ",
			文字大小:0,
			高度:0,
			宽度:0
		},	
		输入框:
		{
			注释:"初始文本、文字大小、最大输入长度、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"喊话时间间隔",
			提示内容:"单位（秒）",
			初始文本:"20",
			仅输入数字:true,
			文字大小:0,
			最大输入长度:0,
			高度:0,
			宽度:0
		},	
		注释:"用于将多个控件放在同一行",
		
		
	},	
	水平布局:
	{
		注释:"用于将多个控件放在同一行",
		文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"设置喊话内容",
			文字大小:0,
			高度:0,
			宽度:0
		},	
		输入框:
		{
			注释:"初始文本、文字大小、最大输入长度、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"喊话内容",
			提示内容:"喊话内容",
			初始文本:"手机百度下载~游戏蜂窝，享受自动练级功能！",
			仅输入数字:false,
			文字大小:0,
			最大输入长度:28,
			高度:0,
			宽度:1000
		},	
	},	
	
	
	水平布局:
	{
		注释:"用于将多个控件放在同一行",
		文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"设置喊话频道",
			文字大小:0,
			高度:0,
			宽度:0
		},	
		下拉框:
		{
			注释:"初始选项是可选属性，默认值为0。模版中设置了三个选项，您可以根据需要增加或减少，注意各选项之间用逗号分隔。",
			名称:"喊话频道",
			选项:
			[
			"世界",
			"国家",
			"交替",
			],
			初始选项:0
		},	
		
	},	
	
	
	
	水平布局:
	{
		注释:"用于将多个控件放在同一行",
		文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"设置喊话次数",
			文字大小:0,
			高度:0,
			宽度:0
		},	
		输入框:
		{
			注释:"初始文本、文字大小、最大输入长度、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"喊话次数",
			提示内容:"喊话次数",
			初始文本:"200",
			仅输入数字:true,
			文字大小:0,
			最大输入长度:0,
			高度:0,
			宽度:200
		},	
	},	
	
文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅",
			文字大小:0,
			高度:0,
			宽度:0
		},	
		文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"====⑨自动送将设置====",
			文字大小:0,
			高度:0,
			宽度:0
		},	
		
文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅",
			文字大小:0,
			高度:0,
			宽度:0
		},
		
		文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"【使用方法】1：所有要送的将全部不配兵；2：所有要送的将放在同一编队；3：要送的封地请收藏在第一个位置",
			文字大小:0,
			高度:0,
			宽度:0
		},	
			文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"★注意：小心驻防偷将的",
			文字大小:0,
			高度:0,
			宽度:0
		},	
		水平布局:
		{
			文字框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"文字框1",
				显示内容:"送第几编队的将：",
				文字大小:0,
				高度:0,
				宽度:0
			},	
			下拉框:
			{
				注释:"初始选项是可选属性，默认值为0。模版中设置了三个选项，您可以根据需要增加或减少，注意各选项之间用逗号分隔。",
				名称:"送将编队",
				选项:
				[
				"1",
				"2",
				"3",
				"4",
				"5",
				],
				初始选项:0
			},	
			
			注释:"用于将多个控件放在同一行",
			
		},	
		
		
				水平布局:
	{
		文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"配兵的兵种位置：",
			文字大小:0,
			高度:0,
			宽度:0
		},	

		下拉框:
		{
			注释:"初始选项是可选属性，默认值为0。模版中设置了三个选项，您可以根据需要增加或减少，注意各选项之间用逗号分隔。",
			名称:"兵种位置",
			选项:
			[
			"1",
			"2",
			"3",
			"4",
			"5",
			"6",
			],
			初始选项:0
		},	
		注释:"用于将多个控件放在同一行",
		
	},	
		
		水平布局:
	{
		文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"设置送将时间间隔（分钟）：",
			文字大小:0,
			高度:0,
			宽度:0
		},	
		输入框:
		{
			注释:"初始文本、文字大小、最大输入长度、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"送将时间间隔",
			提示内容:"单位（分钟）",
			初始文本:"15",
			仅输入数字:true,
			文字大小:0,
			最大输入长度:0,
			高度:0,
			宽度:0
		},	
		注释:"用于将多个控件放在同一行",
		
	},	
		
		水平布局:
	{
		注释:"用于将多个控件放在同一行",
		文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"设置送将次数",
			文字大小:0,
			高度:0,
			宽度:0
		},	
		输入框:
		{
			注释:"初始文本、文字大小、最大输入长度、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"送将次数",
			提示内容:"送将次数",
			初始文本:"200",
			仅输入数字:true,
			文字大小:0,
			最大输入长度:0,
			高度:0,
			宽度:200
		},	
	},	
	文字框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"文字框1",
		显示内容:"---------资源点送将-------------",
		文字大小:0,
		高度:0,
		宽度:0
	},	
	多选框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"开启资源点送将",
		提示内容:"开启资源点送将",
		选中:false,
		文字大小:0,
		高度:0,
		宽度:0
	},	
	
	文字框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"文字框1",
		显示内容:"输入资源点坐标",
		文字大小:0,
		高度:0,
		宽度:0
	},	
	
		
	
	水平布局:
	{
	文字框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"文字框1",
		显示内容:"X：",
		文字大小:0,
		高度:0,
		宽度:0
	},	
		输入框:
		{
			注释:"初始文本、文字大小、最大输入长度、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"送将X坐标点",
			
			提示内容:"X坐标",
			初始文本:"0",
			仅输入数字:true,
			文字大小:0,
			最大输入长度:0,
			高度:0,
			宽度:100
		},	
		注释:"用于将多个控件放在同一行",
	文字框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"文字框1",
		显示内容:"Y：",
		文字大小:0,
		高度:0,
		宽度:0
	},	
		输入框:
		{
			注释:"初始文本、文字大小、最大输入长度、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"送将Y坐标点",
			
			提示内容:"Y坐标",
			初始文本:"0",
			仅输入数字:true,
			文字大小:0,
			最大输入长度:0,
			高度:0,
			宽度:100
		},	
	
	},	
	
			水平布局:
	{
		文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"资源点几分钟后停止送将",
			文字大小:0,
			高度:0,
			宽度:0
		},	
		输入框:
		{
			注释:"初始文本、文字大小、最大输入长度、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"送将停止时间",
			提示内容:"单位（分钟）",
			初始文本:"65",
			仅输入数字:true,
			文字大小:0,
			最大输入长度:0,
			高度:0,
			宽度:0
		},	
		注释:"用于将多个控件放在同一行",
	},	

		
		
	文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅",
			文字大小:0,
			高度:0,
			宽度:0
		},	
		
			文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"=自助截图解决筛选和打矿错误问题=",
			文字大小:0,
			高度:0,
			宽度:0
		},	
		
文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅",
			文字大小:0,
			高度:0,
			宽度:0
		},
		文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"--注：仅限调匹配度也筛选错误时用此功能。",
			文字大小:0,
			高度:0,
			宽度:0
		},	
		
		
		
		文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"--使用说明：",
			文字大小:0,
			高度:0,
			宽度:0
		},	
		文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"1：在前面功能选择里选最后一项-自助截图功能，启动一次截图一次。",
			文字大小:0,
			高度:0,
			宽度:0
		},	
		文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"2：截图宝物时请保证带宝物的十黄在第一个位置，且宝物就在资源后面。",
			文字大小:0,
			高度:0,
			宽度:0
		},	
		文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"3：截图装备时请保证带装备的十黄在第一个位置，且装备就在资源后面。",
			文字大小:0,
			高度:0,
			宽度:0
		},	
			文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"4：截图无人矿时，请确保无人矿在第一个位置。",
			文字大小:0,
			高度:0,
			宽度:0
		},	
		文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"5：请确认手机是安卓默认字体，且不要删除保存在帝王平民辅助文件夹的图片文件。",
			文字大小:0,
			高度:0,
			宽度:0
		},	
		
		文字框:
	{
		注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
		名称:"文字框1",
		显示内容:"-------------------------------------------------",
		文字大小:0,
		高度:0,
		宽度:0
	},	
			文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"--注：请选择9级和10级黄巾的兵种截图。",
			文字大小:0,
			高度:0,
			宽度:0
		},	
		水平布局:
		{
			文字框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"文字框1",
				显示内容:"●截图内容：",
				文字大小:0,
				高度:0,
				宽度:0
			},	
			
			下拉框:
			{
				注释:"初始选项是可选属性，默认值为0。模版中设置了三个选项，您可以根据需要增加或减少，注意各选项之间用逗号分隔。",
				名称:"截图内容",
				选项:
				[
				"弩车",
				"石车",
				"骑兵",
				"弩兵",
				"卫兵",
				"步兵",
				"宝物",
				"装备",
				"无人矿",
				],
				初始选项:0
			},	
			
			注释:"用于将多个控件放在同一行",
		},	
		水平布局:
		{
			文字框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"文字框1",
				显示内容:"●该黄巾贼兵种所在位置：",
				文字大小:0,
				高度:0,
				宽度:0
			},	
			
			下拉框:
			{
				注释:"初始选项是可选属性，默认值为0。模版中设置了三个选项，您可以根据需要增加或减少，注意各选项之间用逗号分隔。",
				名称:"山贼兵种位置",
				选项:
				[
				"1",
				"2",
				"3",
				"4",
				"5",
				],
				初始选项:0
			},	
			
			注释:"用于将多个控件放在同一行",
		},	
		
		文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"--注：根据帝王平民辅助文件夹下的图片文件，感觉位置不合适可以微调。+1意思是往下（或往右）移动1。",
			文字大小:0,
			高度:0,
			宽度:0
		},	
		文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"截图位置整体移动方向（竖屏方向看）：",
			文字大小:0,
			高度:0,
			宽度:0
		},	
		
		水平布局:
		{
			文字框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"文字框1",
				显示内容:"●上下移动：",
				文字大小:0,
				高度:0,
				宽度:0
			},	
		
			下拉框:
			{
				注释:"初始选项是可选属性，默认值为0。模版中设置了三个选项，您可以根据需要增加或减少，注意各选项之间用逗号分隔。",
				名称:"上下移动方向",
				选项:
				[
				"-5",
				"-4",
				"-3",
				"-2",
				"-1",
				"0",
				"+1",
				"+2",
				"+3",
				"+4",
				"+5",
				],
				初始选项:5
			},	

			文字框:
			{
				注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
				名称:"文字框1",
				显示内容:"    左右移动：",
				文字大小:0,
				高度:0,
				宽度:0
			},	
			下拉框:
			{
				注释:"初始选项是可选属性，默认值为0。模版中设置了三个选项，您可以根据需要增加或减少，注意各选项之间用逗号分隔。",
				名称:"左右移动方向",
				选项:
				[
				"-5",
				"-4",
				"-3",
				"-2",
				"-1",
				"0",
				"+1",
				"+2",
				"+3",
				"+4",
				"+5",
				],
				初始选项:5
			},	
			注释:"用于将多个控件放在同一行",
		},	
		
		
		
	多选框:
{
	注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
	名称:"是否根据自助截图筛选黄巾贼",
	提示内容:"是否根据自助截图筛选黄巾贼",
	选中:false,
	文字大小:0,
	高度:0,
	宽度:0
},	
多选框:
{
	注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
	名称:"是否根据自助截图筛选无人矿",
	提示内容:"是否根据自助截图筛选无人矿",
	选中:false,
	文字大小:0,
	高度:0,
	宽度:0
},	
		文字框:
		{
			注释:"文字大小、高度、宽度是可选属性，如需使用默认值，可保持值为0或直接删除此属性",
			名称:"文字框1",
			显示内容:"▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅",
			文字大小:0,
			高度:0,
			宽度:0
		},
}

