//下面每办法代码都被注释了，要用哪部分就删哪部分注释

/*
desc("赞").find().click();//这样会一次性点击找到的所有赞
//如果找不到就不找了
*/


/*
desc("赞").findOne().click();//这样会点击找到的第一个控件
//这个是直到找到为止，如果界面有多个，只找一个
//可以在findOne(3000)括号里加上寻找的时间，这里为持续找3秒，如果没找到就返回空
*/


/*
desc("赞").untilFind().click();//这里结合了上面的两个特性
//至少找到一个，如果有多个就都找出来然后对它们点击
*/


//-----------------一条骚气的分界线--------------------------------------------

/*

function 按顺序赞(){
    
    var a = desc("赞").untilFind();//这里就是找界面符合条件的控件
    var b = a.size();//这里就是找到的控件数量
    
    for(var i=0; i<b; i++){//这里循环点每个(赞)
        for(var k=0; k<10; k++){//这里循环点击10次(赞))
            a.get(i).click();//这里就是索引找到的集合里第i个控件
            sleep(233);
        }
        sleep(666);
    }
    
}

按顺序赞();

*/


//-------------------------------神奇的分界线----------------------------------


/*

function 按个数赞(){
    
    var a = desc("赞").untilFind();//这里就是找界面符合条件的控件
    var b = a.size();//这里就是找到的控件数量
    
    for(var k=0; k<10; k++){//这里循环点击10次(赞)
        for(vari=0; i<b; i++){//这里循环每个(赞)
            a.get(i).click();//这里就是索引找到的集合里第i个控件
            sleep(233);
        }
        sleep(666);
    }
    
}

按个数赞();

*/


//-------------------------接地气的分界线---------------------------------------
