var b = random(0, 2);
if (b == 0) {
    var x = "石头";
} else if (b == 1) {
    var x = "剪刀";
} else if (b == 2) {
    var x = "布";
};
var 选项 = ["石头✊", "剪刀✌", "布✋"];
var a = dialogs.select("选择吧😊", 选项);
if (a >= 0) {
    if (a == b) {
        toastLog("竟然是平局🙌");
    } else if (a == 0 && b == 2 || a == 1 && b == 0 || a == 2 && b == 1) {
        toastLog("你输了👎");
    } else if (a == 0 && b == 1 || a == 1 && b == 2 || a == 2 && b == 0) {
        toastLog("你赢了👍")
    } else {
        toastLog("错误🎭");
    };
} else {
    toastLog("没有选择( •̀∀•́ )✧");
}


/*
var b = Math.random() * 3;
var b1 = Math.ceil(b);
log(b1);


if (b1 === 1) {
    var x = "石头";
} else if (b1 === 2) {
    var x = "剪刀";
} else if (b1 === 3) {
    var x = "布";
}

var a = dialogs.rawInput("石头/剪刀/布");
log(a);
if (a == "石头" || a == "剪刀" || a == "布") {
    if (a === x) {
        toastLog("平局");
    } else if ((a === "石头" && x === "布") || (a === "剪刀" && x === "石头") || (a === "布" && x === "剪刀")) {
        toastLog("你输了，对方出的", x);
    } else if ((a === "布" && x === "石头") || (a === "石头" && x === "剪刀") || (a === "剪刀" && x === "布")) {
        toastLog("你赢了，对方出的", x);
    }
} else {
    toastLog("错误");
    //exit();
}
*/