随机名字()


function 随机名字() {


    var  item1 = [ "赵", "萧","梁","胡","谢", "曹","袁","傅","彭","蒋","蔡","魏","薛","阎","潘","戴","夏","姜","姚","邹","熊",
                        "郝","秦蒋","邵","侯","段","武","赖","龚","奥","夏侯","诸葛","上官","欧阳","尉迟","公孙","岳","墨","琴","涂",
                        "温","匡","余","余","温","景","庄","庄","燕", "司马","景", "马","伊", "樊","朱", "冯","雷","范","穆","麒", "安",
                        "布","卜","白","拜","鲍","庹","崔","程","晨","迟","常","车","翟", "窦", "狄","费","范","郭","葛","恭","霍","孔",
                        "柯","骆","苗","孟","潘", "乔","屠","邰","谭","巫","翁", "徐","肖","萧", "夏","袁","章","童"]
    var item2 = [ "雷" ,"琳" ,"甜","琪","茂", "莆","倩","祥","霞","莠", "唇","汝","瑞","妮","莫","终", "慧","诗","雯","鸿","乔",
                        "雪","君", "雅","森","沐","淮","莉","淑","申","双", "霆","媛","熙","彩","瀚","幽","桦","逸", "智", "鑫", "鹏",
                        "顾","玮","益","轩" ,"明", "琪", "兴","旺","泉","诚","秋","生","骏", "晶", "然","怡","蓉","淳","宇","玉","志",
                        "麻","宏", "静" ,"萱","楚", "茵", "迪", "卡","辉","苑","博","新","豪","炫", "翰", "豪","睿","渊","昊", "宸", "博","哲"]
    var item3 = ["敢", "款", "淦", "筐", "贵", "辜", "凯","植","奠","捷","掎","探","敦","智","棠","淘","淡","焦","婷",
                       "荔","轸", "迦","钧", "婷","喋","塘","塔","暖","楠","幄","涯","焰","雁","雅","雯","喻","宸","瓿","霞",
                       "婺","琬","博","棉","涵","淼","淮","番","徨","惠","斑","酣","邯","媚","彬","棠", "磊" ,"梅", "晴" ,"惠"]
                       var item1 = item1[Math.floor(Math.random()*item1.length)];
                       var item2 = item2[Math.floor(Math.random()*item2.length)];
                       var item3= item3[Math.floor(Math.random()*item3.length)];
 var 名字 = item1+item2+item3;

    log(名字)//随机取姓名
    toast(名字)
}

